extends 基类梅窗口
var 种子
var 订单更新计时器: Timer=null
var UI更新计时器: Timer=null
var 订单上限=[3,0]
var 订单数组=[0,0]
var 生成间隔:int=300
var 网格容器
func _ready() -> void:
	super._ready()
	if not 计划.处理时间戳(计划.梅存档["挂机"]["订单"],0,2):
		计划.处理时间戳(计划.梅存档["挂机"]["订单"],-生成间隔*3)
	订单上限=计划.数据订单("订单上限")
	网格容器=%"网格容器"
	种子=randi()
	检查生成订单()
	加载订单()
	UI更新计时器=计划.创建计时器(1,更新UI)
	%"手动刷新".pressed.connect(func(): 手动刷新订单())
	单独更新订单(%"资源订单/文本",0,500)
	%"资源订单/升级".pressed.connect(func():
		升级订单容量(0,500)
		单独更新订单(%"资源订单/文本",0,500))
	单独更新订单(%"课题订单/文本",1,800)
	%"课题订单/升级".pressed.connect(func():
		升级订单容量(1,800)
		单独更新订单(%"课题订单/文本",1,800))
func _exit_tree() -> void:
	if not 订单更新计时器==null:
		订单更新计时器.queue_free()
	if not UI更新计时器==null:
		UI更新计时器.queue_free()
func 手动刷新订单():
	if 计划.体力门票(5):
		新增订单()
		更新UI()
		计划.emit_signal("更新_UI")
func 升级订单容量(类型=0,增长需求=200):
	订单上限=计划.数据订单("订单上限")
	if 订单上限[类型]>=10:
		计划.语法糖通知("金币不足","订单提示")
		return
	if 计划.语法糖金币消费((订单上限[类型]+1)*增长需求):
		订单上限=计划.数据订单("订单上限",1,类型)
		更新UI()
		计划.保存存档("订单扩容 类型:"+str(类型))
	else :
		计划.语法糖通知("金币不足","订单提示")
func 单独更新订单(节点,类型,增长需求):
	订单上限=计划.数据订单("订单上限")
	节点.text=str((订单上限[类型]+1)*增长需求)+"金币\r"
	节点.text+="增加栏位"
func 更新UI():
	var 剩余时间 = max(1,生成间隔 - 计划.处理时间戳(计划.梅存档["挂机"]["订单"]))
	检查订单容量()
	%"刷新倒计时".text="刷新倒计时:"+计划.格式化时间(剩余时间,2)
	%"资源订单".text="订单上限:"+str(订单数组[0])+"/"+str(订单上限[0])
	%"课题订单".text="课题订单:"+str(订单数组[1])+"/"+str(订单上限[1])
func 检查订单容量():
	var 订单存档=计划.数据订单("订单存档")
	订单数组=[0,0]
	for 订单 in 订单存档:
		#print(订单)
		订单数组[订单.get("订单标记")]+=1
func 检查生成订单():
	var 新增订单数量:int = int(计划.处理时间戳(计划.梅存档["挂机"]["订单"])*1.0 / 生成间隔)  # 显式取整
	if 新增订单数量>=1:
		计划.处理时间戳(计划.梅存档["挂机"]["订单"],新增订单数量*生成间隔)
	if 订单更新计时器==null or 订单更新计时器.is_queued_for_deletion():
		if not is_queued_for_deletion():#预防最后一帧触发导致没有对象
			var 剩余时间 = max(1,生成间隔 - 计划.处理时间戳(计划.梅存档["挂机"]["订单"]) % 生成间隔)
			订单更新计时器=计划.创建计时器(剩余时间,func():
				检查生成订单(),{"是否循环":false})
	if 新增订单数量>=1:
		新增订单(新增订单数量)
	更新UI()
func 加载订单():
	# 第一步：检查并清理没有唯一ID的订单
	var 有效订单 = 计划.数据订单("订单存档")
	# 第二步：加载有效订单
	清除子节点(%"网格容器")
	var 随机生成器: RandomNumberGenerator= RandomNumberGenerator.new()
	随机生成器.seed = 种子
	for 订单信息 in 有效订单:
		var 订单场景实例:订单卡片 = preload("res://界面/插件/订单.tscn").instantiate()
		订单场景实例.订单字典 = 订单信息
		订单场景实例.装饰随机数=随机生成器.randi() % 订单场景实例.装饰词数组.size()
		%"网格容器".add_child(订单场景实例)
		
func 新增订单(订单数量:int=1,订单类型=-1,订单池=["铁锭","纤维","鞣革"],禁用保存=false):#默认值完成一轮订单刷新
	if 订单类型==-1:#-1为尝试刷新所有类型的订单
		检查订单容量()
		新增订单(订单数量,0,订单池,true)
		var 课题订单=0
		for i in 订单数量:
			if 0.25>=randf():
				课题订单+=1
		var 课题=获取已解锁指定类型图纸()
		if 课题.size()>=1 and 课题订单>=1:
			新增订单(课题订单,1,课题,true)
		elif 课题.size()==0:
			计划.语法糖通知("课题订单需要先解锁至少1张图纸")
	else :
		订单数量=min(订单上限[订单类型]-订单数组[订单类型],订单数量)
		print("订单类型",订单类型,"*",订单数量)
		if 订单数组[订单类型]<订单上限[订单类型]:
			var 缓存订单=计划.数据订单("订单存档")
			for i in 订单数量:
				if 订单数组[订单类型]<订单上限[订单类型]:
					var 随机索引 = randi() % 订单池.size()
					var 订单数据={"名称":订单池[随机索引],
				"ID":计划.唯一ID(缓存订单.size()),
				"订单量":随机订单数量(订单类型),
				"幸运值":max(5*(-5+randi() % 10),0),
				"订单标记":订单类型}#"时限":Time.get_unix_time_from_system()+7200
					计划.数据订单("订单存档",订单数据)
					订单数组[订单类型]+=1
	if not 禁用保存:
		加载订单()
		计划.保存存档("测试资源订单")
func 随机订单数量(类型):
	if 类型==1:
		return 10+(randi() % 6)
	return 10+5*(randi() % 4)
func 获取已解锁指定类型图纸():
	var 图纸数据=计划.表格.创世蓝图
	var 蓝图字典=计划.表格.蓝图字典
	var 类型=图纸数据[0].find("类型")
	var 研究方向: Array =计划.手工.数据灵感("研究方向")
	var 图纸数组=[]
	for 图纸 in 图纸数据:
		if 图纸[类型] in 研究方向:
			var 名称=图纸[0]
			if 名称 in 蓝图字典:
				图纸数组=[名称]
	return 图纸数组
