extends 基类梅窗口
var 系统节点:={}
var 原罪=["傲慢","暴食","贪婪","懒惰","暴怒","色欲","嫉妒"]
var 原罪计时器
var 管理选项卡:TabContainer
var 系统选项卡:TabContainer
@onready var 原罪突破: Control = %原罪突破

func _ready() -> void:
	super._ready()#注册
	系统节点={
		"挂机":%"0_挂机",
		"木料":%"1_木料",
		"矿城":%"2_矿城",
		"手工":%"3_手工",
		"游历":%"4_游历",
		"职业":%"5_职业",
		"召唤":%"6_召唤",}
	系统选项卡=%"系统管理"
	系统选项卡.current_tab=计划.窗口状态_限制(基类窗口名称,"管理选项卡",0,系统选项卡.get_tab_count())
	系统选项卡.tab_selected.connect(func(序号):计划.窗口状态管理(基类窗口名称,"系统选项卡",null,序号))
	管理选项卡=%"选项卡"
	管理选项卡.current_tab=计划.窗口状态_限制(基类窗口名称,"管理选项卡",0,管理选项卡.get_tab_count())
	管理选项卡.tab_selected.connect(func(序号):计划.窗口状态管理(基类窗口名称,"管理选项卡",null,序号))
	for 系统名 in 系统节点:#为选项卡重命名
		var 子节点: Node = 系统节点[系统名]# 获取当前选项卡对应的子节点
		var 新标题: String = 子节点.name.replace("_", ".")#节点原始名称替换下划线为小数点
		if 计划.数据系统(系统名)==-1:新标题 += "🔒︎"# 添加锁定表情后缀
		var 选项卡索引: int = 系统节点.keys().find(系统名)# 获取索引
		系统选项卡.set_tab_title(选项卡索引, 新标题)# 设置选项卡标题
	原罪计时器=计划.创建计时器(5,更新原罪)
	更新原罪()
	原罪突破.visibility_changed.connect(更新原罪)
	%"突破按钮".pressed.connect(突破)
	%"傲慢".gui_input.connect(子界面.bind("傲慢"))
	%"暴食".gui_input.connect(子界面.bind("暴食"))
	%"贪婪".gui_input.connect(子界面.bind("贪婪"))
func 子界面(按键,模式):
	if 按键 is InputEventMouseButton:
		if 按键.button_index == MOUSE_BUTTON_LEFT and 按键.pressed:
			计划.切换场景("原罪_%s界面"%模式)
func 突破():
	var 突破结果=计划.数据原罪("尝试突破")
	计划.steam.解锁成就("原罪突破")
	if not 突破结果=="成功":
		计划.语法糖通知(突破结果,"原罪")
		return
	计划.语法糖通知("突破成功","原罪")
	更新原罪()
func 更新原罪():
	var 转移比例数组=[]
	for 系统名 in 系统节点:#触发一轮对应玩法检查原罪值回复逻辑
		if not 计划.数据系统(系统名)==-1:
			if 系统名 =="手工":计划.手工.处理资源回复()
			if 系统名 =="挂机":计划.处理订单更新()
		转移比例数组.append(系统名+"->挂机:"+str("%.0f%%"%(100*计划.数据原罪("熟练转移",系统名))))
	#print(转移比例数组)
	var 熟练转移: Label = %熟练转移
	熟练转移.text="熟练转移\r"+"\r".join(转移比例数组)
	var 原罪值="原罪值:%d"
	for 原罪名 in 原罪:
		原罪值+="\r"+原罪名+":%d/%d"%[计划.数据原罪("原罪值",原罪名),计划.数据原罪("原罪上限",原罪名)]
	原罪值=原罪值%计划.数据原罪("原罪力量")
	%"原罪值".text=原罪值
	var 突破等阶=计划.数据原罪("突破")
	var 突破成功率=计划.数据原罪("突破成功率")*100
	var 精通倍率:float=(1.28**突破等阶)*100
	#print("突破成功率",突破成功率)
	%"突破".text="突破LV:%d
突破成功率:%.1f%%
失败将损失20%%熟练度
突破成功+5挂机等级上限
精通获取乘以1.28(%.0f%%)"%[突破等阶,突破成功率,精通倍率]
