extends 基类梅窗口
@onready var 主菜单: Button = %主菜单
@onready var 吃掉: Button = %吃掉
@onready var 配方容器: 梅物品格子 = %配方容器
@onready var 卡路里条: ProgressBar = %卡路里条
@onready var 卡路数值: Label = %卡路数值
@onready var 美味度条: ProgressBar = %美味度条
@onready var 卡路里标题: OptionButton = %卡路里标题
@onready var 里程碑等级: Label = %里程碑等级
@onready var 美味数值: Label = %美味数值
func _ready() -> void:
	super._ready()#注册
	配方容器.修改返回对象=self
	配方容器.初始更新()
	主菜单.pressed.connect(func():计划.切换场景("原罪界面"))
	吃掉.pressed.connect(判断吃掉)
	计划.过去一秒.connect(更新卡路里)
	卡路里标题.item_selected.connect(更新卡路里)
	返回处理方法()
	更新卡路里()
var 美味度里程碑加成={
	"挂机":"+6体力上限",
	"手工":"+1自动制作精华"}
func 更新卡路里(_序号=0):
	var 卡路里上限=计划.数据原罪("暴食卡路里")
	var 当前卡路里:int=计划.数据状态("卡路里")
	卡路里条.max_value=卡路里上限
	卡路里条.value=当前卡路里
	卡路数值.text="%d/%d"%[当前卡路里,卡路里上限]
	var 当前选项=卡路里标题.text
	var 当前美味=计划.数据原罪("暴食精通",当前选项)
	var 美味上限=计划.数据原罪("暴食精通需求",当前选项)
	美味度条.max_value=美味上限
	美味度条.value=当前美味
	美味数值.text="%d/%d"%[当前美味,美味上限]
	里程碑等级.text="手工里程碑LV:%d\r每级%s\r+10卡路里上限"%[计划.数据原罪("暴食等级",当前选项),美味度里程碑加成[当前选项]]
	更新累计()
@onready var 食物属性: Label = %食物属性
func 返回处理方法(_节点=null):
	判断吃掉(false)
@onready var 介绍: RichTextLabel = $内容节点/介绍
func 更新累计():
	var 状态:Dictionary=计划.梅存档["挂机"]["状态"]
	介绍.text="吃掉食物会增加暴食值,和卡路里,美味里程碑
消耗卡路里收益(每秒消耗%d点)
[img=80x80]res://素材/豆包AI素材/图标/挂机.png[/img](%d/50)点回复1点体力
[img=80x80]res://素材/豆包AI素材/图标/手工.png[/img](%d/20)点回复1精华"%[1,状态.get("卡路里挂机",0),状态.get("卡路里手工",0)]
func 判断吃掉(触发吃掉=true):
	var 食物=配方容器.道具名称
	if 食物==null:
		食物属性.text="放入食物后查看"
		if 触发吃掉 :计划.语法糖通知("请从背包放入食物","暴食提示")
		return
	var 背包数量=计划.检查背包物品数量(食物)
	if 背包数量<1:
		if 触发吃掉 :计划.语法糖通知("食物不足","暴食提示")
		return
	var 食物字典:Dictionary=计划.表格.获取属性(食物,null)
	var 原始卡路里=int(食物字典["卡路里"])
	var 卡路里:int=max(5,原始卡路里)
	var 卡路里文本=""
	if 原始卡路里==卡路里:
		卡路里文本="\r卡路里:%d"%卡路里
	else :
		卡路里文本="\r卡路里:%d(+%d)"%[原始卡路里,卡路里]
	var 当前卡路里=计划.数据状态("卡路里")
	var 卡路里上限=计划.数据原罪("暴食卡路里")
	var 美味度:int=食物字典["美味度"]
	if 计划.表格.蓝图标签检查(食物,"料理"):
		var 存档美味度=计划.手工.数据烹饪菜谱(食物,"美味度")
		if 存档美味度>美味度:美味度=存档美味度
	var 暴食值:int=int(卡路里*0.1+美味度*0.2)
	食物属性.text="库存:%d\r美味精通:%d%s\r暴食值:%d"%[
		背包数量,美味度,卡路里文本,暴食值]
	if 当前卡路里+卡路里>卡路里上限:
		if 触发吃掉 :计划.语法糖通知("你已经吃不下了","暴食提示")
		return
	if 触发吃掉 :
		if 美味度>=50:
			计划.steam.解锁成就("暴食里程碑")
		var 当前选项=卡路里标题.text
		计划.数据原罪("暴食精通",当前选项,美味度)
		计划.语法糖消耗物品(食物,1)
		计划.语法糖通知("成功吃掉食物,暴食增加%d,%s里程碑增加%d"%[暴食值,当前选项,美味度],"暴食提示")
		计划.数据状态("卡路里",0,当前卡路里+卡路里)
		计划.数据原罪("原罪值","暴食",暴食值)
		计划.保存存档("吃掉食物")
		更新卡路里()
