@tool  # 启用编辑器内预览
extends Control
@export_enum("挂机", "木料", "矿城", "手工", "游历", "职业", "召唤") var 系统 = "挂机":
	set(值):
		系统=值
		if Engine.is_editor_hint():_更新_UI()
@export var 查看解锁=false:
	set(值):
		查看解锁=值
		if Engine.is_editor_hint():_更新_UI()
var 等级:int=-1
var 熟练转移:float=0.0
var 原罪值
var 原罪上限
var 解锁条件: Dictionary = {
	"挂机": "已解锁",
	"木料": "敬请期待 计划26年3月版本更新",
	"矿城": "敬请期待 计划26年5月版本更新",
	"手工": "在任务窗口解锁",
	"游历": "敬请期待 计划26年1月版本更新",
	"职业": "敬请期待正式版后更新",
	"召唤": "敬请期待正式版后更新"}
var 原罪介绍: Dictionary = {
	"挂机": "傲慢原罪\n获取：完成小游戏得原罪值\n突破清除当前等级熟练\n成功：等级上限不增加\n失败：增加傲慢上限\n当前傲慢原罪:%d/%d",
	"木料": "暴食原罪\n获取：吃掉不同食物得原罪值\n上限增加：吃掉木灰提升上限\n当前暴食原罪:%d/%d",
	"矿城": "贪婪原罪\n获取：开采贪婪矿石得原罪值\n上限增加：赠礼提升NPC好感度\n当前贪婪原罪:%d/%d",
	"手工": "懒惰原罪\n基础资源溢出转高级资源\n高级资源(零件)溢出加原罪\n上限增加：蓝图升星提升上限\n当前懒惰原罪:%d/%d",
	"游历": "暴怒原罪\n获取：击败怪物获得原罪值\n上限增加：锻炼达成条件\n当前暴怒原罪:%d/%d",
	"职业": "色欲原罪\n获取：根据所选职业有所不同\n上限增加：根据所选职业有所不同\n当前色欲原罪:%d/%d",
	"召唤": "嫉妒原罪\n获取：部分异想体互动结果增加\n上限增加：部分异想体互动增加\n当前嫉妒原罪:%d/%d"
}
var 权限介绍: Dictionary = {
	"挂机": "挂机等级提升效果\r1.精通池容量+LV800\r2.每级增加10%熟练度获取\r3.每次突破精通获取乘以1.28",
	"木料": "木料等级提升效果\r1.精通池容量+LV1000\r其他权限暂未完成设计",
	"矿城": "矿城等级提升效果\r1.精通池容量+LV1000\r其他权限暂未完成设计",
	"手工": "手工等级提升效果\r1.精通池容量+LV1000\r2.资源容量增加\r3.资源回复速度增加\r4.每10级增加1个制作栏位",
	"游历": "游历等级提升效果\r1.精通池容量+LV1000\r其他权限暂未完成设计",
	"职业": "职业等级提升效果\r1.精通池容量+LV1000\r其他权限暂未完成设计",
	"召唤": "召唤等级提升效果\r1.精通池容量+LV1000\r其他权限暂未完成设计"
}
func _ready() -> void:
	_更新_UI()
	%"熟练转移".drag_ended.connect(func(编辑):if 编辑:计划.数据原罪("熟练转移",系统,%"熟练转移".value))
func _更新_UI() -> void:
	if not has_node("等级显示") or not is_instance_valid($"等级显示"):
		return
	if Engine.is_editor_hint():
		if 查看解锁:等级=100
		else :
			等级=-1
		熟练转移=0
		原罪值=0
		原罪上限=10
	else :
		等级=计划.数据系统(系统)
		熟练转移=计划.数据原罪("熟练转移",系统)
		原罪值=计划.数据原罪("原罪值",系统)
		原罪上限=计划.数据原罪("原罪上限",系统)
	if 等级==-1:
		$"锁定".visible=true
		$"内容区域".visible=false
	else :
		$"内容区域".visible=true
		$"锁定".visible=false
	$"等级显示".系统=系统
	$"等级显示".玩法=系统
	$"等级显示"._更新_UI()
	%"解锁条件".text=解锁条件[系统]
	var 格式化文本: String=原罪介绍[系统]
	%"原罪介绍".text=格式化文本%[原罪值,原罪上限]
	%"权限介绍".text=权限介绍[系统]
	if Engine.is_editor_hint():pass
	if 系统=="挂机":
		%"熟练转移".visible=false
		%"突破等级".visible=true
	else :
		%"突破等级".visible=false
		%"熟练转移".visible=true
		%"熟练转移".value=熟练转移
