extends Panel
class_name 蓝图卡片
var 蓝图字典
var 优先级=0
func 蓝图解析():
	var 手工存档=初始化.梅存档["手工"]
	var 蓝图名称=蓝图字典.get("名称","错误")
	var 精通需求=初始化.结算升级("手工",蓝图名称,false)
	var 精通=蓝图字典.get(蓝图名称+"精通",0)
	var 精通等级=手工存档.get(蓝图名称,-1)
	var 缓存残缺等级=手工存档.get(蓝图名称+"碎片",0)
	if 精通等级>=0:
		优先级+=精通等级
		$"蓝图名称".text=蓝图名称+"\n"+"LV:"+str(精通等级)
		$"精通条".max_value=精通需求
		$"精通条".value=精通
		$"精通条/精通".text=str(精通)+"/"+str(精通需求)
		$"精通条".visible=true
		modulate=Color(1, 1, 1)
	else :
		$"蓝图名称".text=蓝图名称+"\n"+"暂未获得该蓝图"
		$"精通条".visible=false
		if 缓存残缺等级>=1:
			modulate=Color(0.8, 0.8, 0.8, 0.9)
		else :
			modulate=Color(0.4, 0.4, 0.4, 0.8)
	var 缓存贴图=load(蓝图字典.get("icon",""))
	if 缓存贴图:
		$"图片".texture=缓存贴图
	$"标签/简介".visible=true
	var 缓存简介=蓝图字典.get("简介","错误")
	if 缓存残缺等级>=1:
		优先级+=1
		缓存简介="拥有残缺蓝图*"+str(缓存残缺等级)+"\n"+缓存简介
	if 精通等级>=0:
		缓存简介+="\n"+"精通效果:#未实装\r"
		var 类型 = 蓝图字典.get("类型","错误")
		if 类型=="符文":
			缓存简介+="订单价格提高"+str("%.2f" % min(20,1.0305 ** 精通等级))+"倍"
		elif 类型=="基础素材":
			缓存简介+="制作数量+"+str("%.2f" % (精通等级 * 0.05))
		else :
			缓存简介+="装备耐久增加"+str(精通等级)+"%"+"\r充能素材使用上限+"+str(精通等级 * 5)+"%"
	$"标签/简介".text=缓存简介
	var 材料列表 = []
	for 键 in 初始化.材料对照:
		if 蓝图字典.has(键) and 蓝图字典[键] > 0:
			材料列表.append(键 + "*" + str(int(蓝图字典[键])))
	var 内容字符串 = "费用:" + ("\r"+"\r".join(材料列表) if 材料列表.size() > 0 else "无")
	for 贴图 in 初始化.材料贴图:
		内容字符串 = 内容字符串.replace(贴图+"*", "[img=40x40]"+初始化.材料贴图[贴图]+"[/img]:")
	$"标签/材料".text=内容字符串
	$"标签/属性".text=初始化.获取装备属性(蓝图字典)
