@tool
extends EquipmentData
class_name 物品装备
var 基础数值 = {
	"长剑": { # 平衡型
		"攻击": 1,
		"攻击距离": 1,
		"攻速": 1,
		"随机属性":{"精通力":4,"血量力":20,"攻击力":10},
		"成长率":{"精通力":Vector2(0, 2),"血量力":Vector2(5, 10),"攻击力":Vector2(1, 3)},
		},
	"斧头": { # 高攻低攻速
		"攻击": 1.2,
		"攻击距离": 1,
		"攻速": 0.84
	},
	"匕首": { # 高攻速短距离
		"攻击": 0.65,
		"攻击距离": 0.5,
		"攻速": 1.5
	},
	"战锤": { # 超高攻
		"攻击": 2,
		"攻击距离": 0.5,
		"攻速": 0.5
	},
	"矛": { # 长距离平衡型
		"攻击": 1.1,
		"攻击距离": 1.2,
		"攻速": 0.9
	},
	"弓": { # 远程高攻
		"攻击": 1,
		"攻击距离": 5,
		"攻速": 1
	},
	"法杖": {
		"攻击": 0.8,
		"攻击距离": 4,
		"攻速": 1
	},
	"魔杖": {
		"攻击": 0.85,
		"攻击距离": 3.5,
		"攻速": 1
	},
	"手弩": { # 中距离快攻速
		"攻击": 0.66,
		"攻击距离": 3,
		"攻速": 1.5
	},
	"火枪": { # 远程低攻速
		"攻击": 1.5,
		"攻击距离": 5,
		"攻速": 0.6
	},
	# 副手装备
	"盾牌": {
		"血量": 0.2,
		"减伤": 0.1,
		"随机属性":{"精通力":4,"血量力":20},
		"成长率":{"精通力":Vector2(0, 2),"血量力":Vector2(5, 10)},
	},
	"卷轴": {
		"魔法": 0.75,
	},
	"箭袋": {
		"攻击": 0.2,
	},
	"护手": {#副手
		"血量": 0.1,
		"减伤": 0.15,
		"随机属性":{"精通力":4,"血量力":15},
		"成长率":{"精通力":Vector2(0, 2),"血量力":Vector2(5, 8)},
	},
	"手套": {
		"攻击": 0.1,
		"血量": 0.2,
	},
	# 头盔装备
	"头盔": {
		"血量": 0.15,
		"减伤": 0.25,
		"随机属性":{"精通力":4,"暴怒力":5,"血量力":15},
		"成长率":{"精通力":Vector2(0, 2),"暴怒力":Vector2(1, 4),"血量力":Vector2(5, 8)},
	},
	"盗贼帽": {
		"血量": 0.15,
		"减伤": 0.25
	},
	"法师帽": {
		"魔法": 0.1,
		"血量": 0.15,
		"减伤": 0.25
	},
	# 衣服装备
	"重甲": {
		"血量": 0.2,
		"减伤": 0.3,
		"随机属性":{"精通力":4,"暴怒力":5,"血量力":15},
		"成长率":{"精通力":Vector2(0, 2),"暴怒力":Vector2(1, 4),"血量力":Vector2(5, 8)},
	},
	"轻甲": {
		"血量": 0.2,
		"攻击": 0.1,
		"减伤": 0.3
	},
	"法袍": {
		"血量": 0.2,
		"魔法": 0.1,
		"减伤": 0.3
	},
	# 裤子装备
	"腿甲": {
		"血量": 0.2,
		"减伤": 0.2,
		"随机属性":{"精通力":4,"暴怒力":5,"血量力":15},
		"成长率":{"精通力":Vector2(0, 2),"暴怒力":Vector2(1, 4),"血量力":Vector2(5, 8)},
	},
	"法裤": {
		"血量": 0.2,
		"魔法": 0.2,
		"减伤": 0.15
	},
	"裤子": {
		"血量": 0.2,
		"攻击": 0.1,
		"减伤": 0.15
	},
	# 鞋子装备
	"鞋子": {
		"血量": 0.2,
		"减伤": 0.15,
		"随机属性":{"精通力":4,"暴怒力":5,"血量力":15},
		"成长率":{"精通力":Vector2(0, 2),"暴怒力":Vector2(1, 4),"血量力":Vector2(5, 8)},
	},
	"靴子": {
		"血量": 0.2,
		"攻击": 0.1,
		"减伤": 0.1
	},
	"法鞋": {
		"血量": 0.2,
		"魔法": 0.1,
		"减伤": 0.1
	},
	# 饰品装备
	"项链": {
		"回血": 1
	},
	"光环": {
		"回蓝": 1
	},
	# 披挂装备
	"披风": {
		"闪避": 1
	},
	"宠物": {
		"暴击": 1
	},
	"戒指": {
		"回血": 1 # 固定属性（四选一）
		},
	"手杖":{
		"随机属性":{"精通力":5,"懒惰力":5,"制作力":5,"研究力":5},
		"成长率":{"精通力":Vector2(0, 2),"懒惰力":Vector2(0, 2),"制作力":Vector2(0, 1),"研究力":Vector2(0, 1)},
		},
	"炼金台":{
		"随机属性":{"精通力":5,"懒惰力":5,"炼金力":5,"烹饪力":5},
		"成长率":{"精通力":Vector2(0, 2),"懒惰力":Vector2(0, 2),"炼金力":Vector2(0, 1),"烹饪力":Vector2(0, 1)},
		},
	"厨具":{
		"随机属性":{"精通力":5,"懒惰力":5,"制作力":5,"烹饪力":5},
		"成长率":{"精通力":Vector2(0, 2),"懒惰力":Vector2(0, 2),"制作力":Vector2(0, 1),"烹饪力":Vector2(0, 1)},
		}
	}
@export_group("职业属性")
## "分类"或"职业">"类型"
##"分类"可选项["武器","护甲","饰品"]决定物品检索,定义装备逻辑.武器仅限主手单件 副手可选护甲或饰品分类
@export_enum("武器","护甲","饰品","工具") var 分类: String = "武器"
##"类型"装备的具体对应装备槽,部分固定属性由"职业"与"类型"决定
@export_enum("长剑", "斧头", "匕首", "战锤", "矛", "弓", "法杖", "魔杖", "手弩", "火枪",
"盾牌", "乐器", "卷轴", "箭袋","护手", "手套",
"头盔", "盗贼帽", "法师帽","重甲", "轻甲", "法袍","腿甲", "法裤", "裤子","靴子", "鞋子", "法鞋",
"项链", "光环","披风", "宠物","戒指",
"手杖","炼金","厨具")
var 类型: String = "长剑":# 默认值为"长剑"，值直接是字符串
	set(值):
		类型=值
		type = 类型
##"职业"可选项["战士","法师","射手"]部分固定属性由"职业"与"类型"决定
@export_enum("战士","法师","射手") var 职业: String = "战士"
@export var 创建数据:bool=false
@export_group("装备属性")
@export var 附魔: Dictionary[String, int] = {}
## 装备阶级 每1级对应5级游历系统等级,最高20.
@export var 阶级: int = 1
@export var 等级: int = 1
@export var 基础属性:Dictionary={}
@export var 耐久:int=0
@export var 种子:int
@export var 强化最大:float=10
@export var 强化:float=10

func 更新属性(设定种子:int=randi()):
	if 创建数据:
		super.更新属性()
	else :
		super.更新属性()
		装备初始化(设定种子)
		创建数据=true
func 拷贝方法():#所有继承方法如果希望被正确拷贝都需要重写
	return 物品装备.new(1,item_name)
func 装备初始化(设定种子:int=randi()):
	var 随机=RandomNumberGenerator.new()
	随机.seed = 设定种子
	种子=随机.randi()
	分类=计划.表格.蓝图数据(item_name,"分类")
	类型=计划.表格.蓝图数据(item_name,"类型")
	职业=计划.表格.蓝图数据(item_name,"职业")#非战斗装备,职业为空
	基础属性={}
	随机属性(随机)
func 随机属性(随机:RandomNumberGenerator):
	if not 通用检查("随机属性"):
		return
	var 权重=随机.randf()
	var 待抽取属性:Dictionary=基础数值[类型]["随机属性"].duplicate()
	var 待抽取数量:int=待抽取属性.size()
	var 属性名数组:Array
	var 装备阶级=计划.表格.蓝图数据(item_name,"阶级")
	阶级=装备阶级
	var 属性数量:int=int(max(1,待抽取数量*装备阶级/20))#阶级最大20
	if 权重>0.9:#6条属性的装备大概14阶有概率满级
		属性数量+=2
	elif 权重>0.5:
		属性数量+=1
	for i in range(min(待抽取数量,属性数量)):
		if 待抽取属性.size()<1:
			return
		属性名数组=待抽取属性.keys()
		var 属性名称=属性名数组[随机.randi() % 属性名数组.size()]
		基础属性[属性名称]=float(待抽取属性[属性名称])
		待抽取属性.erase(属性名称)
func 装备升级(目标等级:int):
	if not 通用检查("成长率"):#如果没有成长率退出升级逻辑
		return
	if 等级>=目标等级:
		return
	var 成长率:Dictionary=基础数值[类型]["成长率"].duplicate()
	var 需要检查的元素=获取数组交集(基础属性.keys(),成长率.keys())
	var 随机=RandomNumberGenerator.new()
	for i in range(目标等级-等级):
		if 等级>=阶级*5:
			计划.语法糖通知("错误装备已满级","装备错误")
			return
		随机.seed = 种子
		种子=随机.randi()#保存下个等级使用的随机数
		for 升级属性 in 需要检查的元素:
			var 随机值:Vector2=成长率[升级属性]
			var 最小:float=随机值.x
			var 最大:float=随机值.y
			if 最小 > 最大:
				var 临时值 = 最小
				最小 = 最大
				最大 = 临时值
			var 最大属性值=(最大 - 最小)
			var 随机属性值=min(1,1.2*随机.randf())*最大属性值
			基础属性[升级属性]+=随机属性值 + 最小
			强化最大+=最大属性值
			强化+=随机属性值
		等级+=1
		#使用随机数计算本次升级的逻辑
func 获取数组交集(数组A: Array, 数组B: Array) -> Array:
	# 过滤出数组A中同时存在于数组B中的元素
	return 数组A.filter(func(元素):
		return 元素 in 数组B)
# 装备时调用
func equipped(_装备栏: String) -> void:
	pass
# 脱装备时调用
func unequipped(_装备栏: String) -> void:
	pass
func 基础检查()->bool:
	return 基础数值.has(类型)
func 通用检查(条件)->bool:
	if 条件 is String:
		return 基础数值.has(类型) and 基础数值[类型] is Dictionary and 基础数值[类型].has(条件)
	elif 条件 is Array:
		if 基础数值.has(类型) and 基础数值[类型] is Dictionary:
			for 条件文本 in 条件:
				if not 基础数值[类型].has(条件):
					return false
			return true
		else :return false
	return false
##返回宝石简介
func 返回简介(_背包名:String,参数:Dictionary={})->String:
	var 装备阶级=计划.表格.蓝图数据(item_name,"阶级")
	var 倍率:float=参数.get("倍率",1.0)
	var 倍率文本:String=""
	if 倍率>1:
		倍率文本="x%.2f"%倍率
	var 简介:String="装备<%s_%s> %s"%[item_name,计划.罗马数字(装备阶级),倍率文本]
	var 属性数组=[]
	var 属性文本=""
	属性数组.append("等级:%d/%d"%[等级,阶级*5])
	if _背包名=="强化栏":
		属性数组.append("完美度:%.1f%%"%[(强化/强化最大)*100])
	var 字典:Dictionary=基础数值[类型]
	if ["武器"].has(分类):
		属性数组.append("攻击%.1f%%"%(字典["攻击"]*100))
		属性数组.append("攻击距离x%.1f"%(字典["攻击距离"]))
		属性数组.append("攻速:%.1f%%"%(字典["攻速"]*100))
	elif 字典.has("攻击"):
		属性数组.append("攻击:+%.1f%%"%(字典["攻击"]*100))
	if 字典.has("减伤"):
		属性数组.append("减伤:%.1f%%"%(字典["减伤"]*100))
	if 字典.has("血量"):
		属性数组.append("生命上限:+%.1f%%"%(字典["血量"]*100))
	if 字典.has("魔法"):
		属性数组.append("魔法上限:+%.1f%%"%(字典["魔法"]*100))
	for 属性名 in 基础属性:
		if _背包名=="强化栏" and 字典.has("成长率") and 字典.成长率.has(属性名):
			var 属性成长:Vector2=字典.成长率[属性名]
			属性数组.append("%s:+%.1f+(升级+%d_%d)"%[属性名,基础属性[属性名],属性成长.x,属性成长.y])
		else :
			属性数组.append("%s:+%.1f"%[属性名,基础属性[属性名]*倍率])
	if 属性数组.size()>=1:
		属性文本="\n"+"\n".join(属性数组)
	return 简介+属性文本
