extends 基类梅窗口
var 配方: Dictionary=	{"材料名称"=["炽心草茎","发条虫蜕","风翎符片","腐翼鳞粉"],
						"材料数量"=[5,6,7,10],
						"催化剂"="圣盾徽记"}
#var 配方: Dictionary=	{"材料名称"=[],
						#"材料数量"=[],
						#"催化剂"=null}
var 配方编号=-1
var 存档配方数组=[]
var 配方格子
func _ready() -> void:
	super._ready()
	%"背包栏".folded=true
	背包折叠(true)
	%"背包栏".folding_changed.connect(func(折叠): 背包折叠(折叠))
	GBIS.connect("鼠标物品",func():
		%"背包栏".folded=true
		背包折叠(%"背包栏".folded))
	生成预览描述()
	生成配方详情文本()
	配方格子=%"配方格子"
	配方格子.配方编号=-1
	配方格子.配方=配方
	配方格子.加载配方信息()
	生命周期计时器+=[初始化.创建计时器(8,func(): 定期更新提示文本(%"温馨提示"))]#每隔8秒更新一次文本
	定期更新提示文本(%"温馨提示")
	
func 背包折叠(折叠):
	if 折叠:
		%"背包栏".title="<背包"
		%"背包栏".size=Vector2(180,60)
		%"背包栏".position=Vector2(1520,100)
	else :
		%"背包栏".title="背包>"
		%"背包栏".size=Vector2(1000,900)
		%"背包栏".position=Vector2(675,100)
func 生成预览描述():
	var 文本:=""
	var 满足的条件=0
	if 配方.get("材料名称",[]).size()<3:
		文本+="缺少炼金材料[font_size=30]你需要放入至少3种炼金材料[/font_size]"+"\r"
	else :
		文本+="+".join(配方["材料名称"])+"\r"
		满足的条件+=1
	if 配方["催化剂"]==null:
		文本+="缺少催化剂[font_size=30]你需要放入催化剂[/font_size]"+"\r"
	else :
		文本+="催化剂:"+配方["催化剂"]+"\r"
		满足的条件+=1
	if 配方编号==-1:
		文本+="[font_size=30]配方未保存前不会被了解[/font_size]"+"\r"
	elif  满足的条件==2:
		文本+="稀有奖励:"+"\r"
		文本+="当前记录数量:"+str(存档配方数组)+"\r"
	文本+="放入炼金材料后展示更多信息"+"\r"
	文本+="连续制作20次可了解配方"
	%"配方预览".text=文本
func 生成配方详情文本():
	var 文本="当前配方\r"
	文本+="催化剂:"+(查询图片("星核矿砂",100)+"\r"if not 配方["催化剂"]==null else "\r")
	文本+="材料:"
	if 配方.get("材料名称",[]).size()>=1:
		var 序号=0
		for 图片名称 in 配方["材料名称"]:
			文本+=(""if 序号==0 else",")+查询图片(图片名称,80)+"*"+str(配方["材料数量"][序号])
			序号+=1
	%"配方详情".text=文本
func 查询图片(图片,尺寸:int):
	if 图片 in 梅表格.蓝图字典:
		var 图片文本=梅表格.蓝图字典[图片][梅表格.蓝图表头["icon"]]
		return "[img="+str(尺寸)+"x"+str(尺寸)+"]"+图片文本+"[/img]"
	return
#一、核心层级颜色方案（适配子区域）
#主色调（基础区域）：#8d6e2f（原始色，用于主界面、核心模块）
#一级子区域色：#b08e45（比主色亮 20%，明度提升，视觉优先级高，适配主要功能子区）
#二级子区域色：#6b5423（比主色暗 20%，明度降低，视觉从属，适配次级功能子区）
#三级子区域色（可选）：#d4b466（比一级色更亮 15%，用于细分小模块，避免层级混淆）
#二、辅助强调色（增强区分）
#功能强调色：#a13d30（暗红棕，与主色调同色系，用于按钮、警示等关键交互元素）
#背景过渡色：#f5eee0（浅米白，搭配主色调不突兀，用于子区域背景分层）
