extends Control
##不填可以放入所有食材,填写后只能放制定标签食材
@export var 限制属性类型:Dictionary={}
##显示的名称
@export var 工序名称:String="工序"
##显示的图标名称
@export var 工序图标:String="爱心"
##显示的描述文本
@export_multiline var 工序描述:String="一段工序描述\r描述内容"
##只能放入指定预制标签,并给予对应新预制标签
@export var 需求标签:Dictionary[String,String]={"":"工序"}
@export var 点击次数:int=10

@onready var 工序进度: ProgressBar = %"工序进度"
@onready var 点击按钮: Button = %"点击按钮"
@onready var 工序名称节点: Label = $"节点排序/名称排序/工序名称"
@onready var 贴图: Control = $节点排序/名称排序/贴图
@onready var 工序描述节点: Label = $节点排序/工序描述
@onready var 配方容器: Panel = $节点排序/配方容器
@onready var 资源: Control = %资源
##外部节点
@onready var 食材标签: TabContainer = %食材标签

var 道具名称=null
var 道具标签=""
func _ready() -> void:
	贴图.设置BUFF图标(工序图标)
	工序名称节点.text=工序名称
	工序描述节点.text=工序描述
	if 点击次数>=1 or 点击次数==-1:
		点击按钮.pressed.connect(点击更新)
		工序进度.min_value=0
		if 点击次数==-1:
			工序进度.max_value=1
		else :
			工序进度.max_value=点击次数
		工序进度.value=0
		点击按钮.visible=true
		工序进度.visible=true
		配方容器.visible=true
		配方容器.修改返回对象=self
		配方容器.限制属性类型=限制属性类型
		var 道具的名称=计划.窗口状态管理("烹饪界面","卡片_"+工序名称,"")
		配方容器.道具名称=道具的名称 if not 道具的名称=="" else null
		配方容器.特殊标签=计划.窗口状态管理("烹饪界面","卡片标签_"+工序名称,"")
		配方容器.初始更新()
		返回处理方法(配方容器)
		配方容器.mouse_entered.connect(悬浮提示)
		配方容器.mouse_exited.connect(func():资源.visible=false)
	else :
		点击按钮.visible=false
		工序进度.visible=false
		配方容器.visible=false
func 悬浮提示():
	if not 道具名称==null:
		var 坐标=配方容器.global_position + Vector2(0, -10)
		坐标.x+=配方容器.size.x*0.5
		var 数量=计划.手工.烹饪预制(道具名称,道具标签)
		var 上限=食材标签.食材上限
		if 道具标签=="":
			上限=计划.表格.蓝图数据(道具名称,"堆叠")
		资源.更新传入新值({"数量":数量,"物品类型":道具名称,"标签":道具标签},上限,坐标)


func 点击更新():
	if 道具名称==null:return
	var 缓存道具名称=道具名称
	if 工序名称=="删除":
		删除逻辑()
		return
	if not 工序名称=="调料研磨":
		var 上限=食材标签.食材上限
		var 目标数量=计划.手工.烹饪预制(缓存道具名称,需求标签[道具标签])
		var 瓶子数量=食材标签.食材数组.size()
		if 目标数量>=上限:
			计划.语法糖通知("达到上限:%s加工的物品超过%d个"%[需求标签[道具标签],上限],"工序错误")
			工序进度.value=工序进度.min_value
			return
		elif 目标数量==0 and 瓶子数量>=食材标签.食材瓶限制:
			计划.语法糖通知("瓶子过多","工序错误")
			工序进度.value=工序进度.min_value
			return
	工序进度.value+=1
	var 背包物品数量
	if 工序名称=="调料研磨":
		背包物品数量=计划.检查背包物品数量(缓存道具名称)
	else: 
		背包物品数量=计划.手工.烹饪预制(缓存道具名称,道具标签)
	if 工序进度.value>=工序进度.max_value and 背包物品数量>=1:
		工序进度.value=工序进度.min_value
		背包物品数量-=1
		if 工序名称=="调料研磨":
			计划.语法糖消耗物品(缓存道具名称,1)
			计划.手工.数据调料点数(缓存道具名称,10)
		else :
			if 道具标签=="":
				计划.语法糖消耗物品(缓存道具名称,1)
			else :
				计划.手工.烹饪预制(缓存道具名称,道具标签,-1)
			计划.任务.完成预制任务(缓存道具名称,需求标签[道具标签],1)
			计划.手工.烹饪预制(缓存道具名称,需求标签[道具标签],1)
		计划.更新_UI.emit()
		计划.保存存档("预制加工")
	if 背包物品数量<1:
		工序进度.value=工序进度.min_value
		if 道具标签=="":
			计划.语法糖通知("未加工的%s物品不足%d个"%[缓存道具名称,1],"工序错误")
		else :
			计划.语法糖通知("%s加工的%s物品不足%d个"%[道具标签,缓存道具名称,1],"工序错误")
		解除物品()
		return
func 返回处理方法(_节点=null):
	if 工序名称=="删除":
		道具名称=配方容器.道具名称
		道具标签=配方容器.特殊标签
	elif 需求标签.has(配方容器.特殊标签):
		道具名称=配方容器.道具名称
		道具标签=配方容器.特殊标签
		if 道具名称==null:
			计划.窗口状态管理("烹饪界面","卡片_"+工序名称,null,"")
		else :
			计划.窗口状态管理("烹饪界面","卡片_"+工序名称,null,道具名称)
		计划.窗口状态管理("烹饪界面","卡片标签_"+工序名称,null,道具标签)
		if 道具名称==null:
			工序进度.value=工序进度.min_value
	else :
		计划.语法糖通知("这道工序不能对%s进行"%配方容器.特殊标签,"工序错误")
		解除物品()
func 解除物品():
	配方容器.道具名称=null
	配方容器.特殊标签=""
	道具名称=null
	道具标签=""
	配方容器.更新文本()
func 删除逻辑():
	if 道具标签=="":
		计划.语法糖通知("删除普通物品使用背包内删除逻辑","工序错误")
		return
	var 背包物品数量=计划.手工.烹饪预制(道具名称,道具标签)
	if 背包物品数量>=1:
		计划.手工.烹饪预制(道具名称,道具标签,-背包物品数量)
		计划.更新_UI.emit()
		计划.保存存档("删除瓶子")
	解除物品()
