extends Panel
var 配方容器场景:梅物品格子 = preload("res://界面/插件/配方容器.tscn").instantiate()
@export var 料理名称:String=""
##场景中卡片会被代码移除重新生成,设置为真不执行后续逻辑
@export var 演示模式:bool=false
@onready var 食材容器: HBoxContainer = %食材容器
@onready var 食材标题: Label = %食材标题
@onready var 材料: RichTextLabel = $料理排序/材料
@onready var 贴图: TextureRect = $料理排序/顶部信息/贴图
@onready var 属性标签: Label = $料理排序/顶部信息/属性标签
@onready var 制作: Button = $料理排序/按钮容器/制作
@onready var 保存: Button = $料理排序/按钮容器/保存

var 格子节点数组:Array=[]
var 基础美味度:float
var 解锁美味度:float
var 当前美味度:float=0
var 当前调料加成:float=0.0
var 所需材料数:int=0
var 味道:String=""
var 代币费用:int
var 菜谱:Dictionary
var 卡路里:int
var 材料数组:Array=[]
##材料是否满足
var 材料判断:bool=true
var 菜谱判断:bool=true

var 修改过配方:bool=false
func _ready() -> void:
	if 演示模式:
		return
	加载食材()
	加载解锁()
	resized.connect(更新材料标签)
	制作.pressed.connect(制作料理)
	保存.pressed.connect(保存料理)
@onready var 解锁按钮: Button = $未解锁/解锁标签/解锁按钮
@onready var 解锁标签: Label = $未解锁/解锁标签
@onready var 未解锁: Panel = $未解锁
func 加载解锁():
	if 计划.手工.数据烹饪菜谱(料理名称,"等级")==-1:
		解锁按钮.pressed.connect(解锁判断)
		未解锁.visible=true
		解锁标签.text="你需要消耗%d个\r烹饪代币解锁"%代币费用
	else :
		未解锁.visible=false
func 解锁判断():
	if 计划.检查背包物品数量("烹饪代币")>=代币费用:
		计划.语法糖消耗物品("烹饪代币",代币费用)
		计划.语法糖通知("配方已解锁")
		计划.手工.获得菜谱(料理名称)
		计划.更新_UI.emit()
		未解锁.visible=false
	else :
		计划.语法糖通知("配方代币不足")
var 配置字典={"可修改数量":false,"编号":1,"限制类型":["食材"],"空置标签":"","默认值":5,"修改返回对象": self}
func 加载食材():
	修改过配方=false
	计划.清除子节点(食材容器,食材标题)
	格子节点数组=[]
	var 属性=计划.表格.获取属性(料理名称,null)
	if 属性 is Dictionary:
		基础美味度=计划.手工.数据烹饪菜谱(料理名称,"基础美味度")
		解锁美味度=计划.手工.数据烹饪菜谱(料理名称,"解锁美味度")
		代币费用=属性.get("代币",100)
		菜谱=属性.get("菜谱",{})
		卡路里=属性.get("卡路里",0)
		贴图.texture=计划.表格.道具贴图(料理名称)
		#print("打印数据",基础美味度,"/",代币费用,菜谱)
		材料数组=[]
		所需材料数=0
		var 保存菜谱:Dictionary
		var 菜谱正常:bool=计划.手工.烹饪耗时(料理名称)>0
		var 编号=0
		if 菜谱正常:
			保存菜谱=计划.手工.数据烹饪菜谱(料理名称,"保存菜谱","返回")
		else :
			配置字典["道具名称"]=null
			配置字典["特殊标签"]=""
		for 内容 in 菜谱:
			var 材料格子:梅物品格子=配方容器场景.duplicate()
			配置字典["编号"]=编号
			if 内容=="味道":
				味道=菜谱[内容]
				配置字典["空置标签"]="调味品"
				配置字典["默认值"]=1
				配置字典["限制类型"]=["调料"]
				if 菜谱正常:
					配置字典["道具名称"]=保存菜谱["调味品"]["物品"]
					配置字典["特殊标签"]=""
				材料数组.append("口味:"+str(菜谱[内容]))
			else :
				配置字典["默认值"]=int(菜谱[内容])
				配置字典["空置标签"]=内容
				配置字典["限制类型"]=["食材"]
				if 菜谱正常:
					配置字典["道具名称"]=保存菜谱[内容]["物品"]
					配置字典["特殊标签"]=保存菜谱[内容]["标签"]
				所需材料数+=int(菜谱[内容])
				材料数组.append(内容+"*%.0f"%菜谱[内容])
			材料格子.custom_minimum_size=Vector2(100,100)
			材料格子.从字典初始化(配置字典)
			食材容器.add_child(材料格子)
			格子节点数组.append(材料格子)
			编号+=1
			更新标签()
			更新材料标签()
	else :
		print("错误,食物%s加载失败"%料理名称,属性)
func 更新材料标签():
	var 自动烹饪耗时:float=计划.手工.烹饪耗时(料理名称)
	if size.y>500:
		if 自动烹饪耗时<=0:
			材料.text="需要:\r"+",".join(材料数组)+"\r自动烹饪耗未解锁"
		else :
			材料.text="需要:\r"+",".join(材料数组)+"\r自动烹饪耗时:%.0f秒"%自动烹饪耗时
	else :
		if 自动烹饪耗时<=0:
			材料.text="自动烹饪耗未解锁"
		else :
			材料.text="自动烹饪耗时:%.0f秒"%自动烹饪耗时
@onready var 启用自动制作节点: CheckButton
@onready var 制作数量节点: SpinBox

func 更新标签(检查通知=false):
	计算美味度()
	材料判断=true
	var 扣除数量=1
	if 启用自动制作节点.button_pressed:
		扣除数量=int(制作数量节点.value)
	for 节点 in 格子节点数组:
		if 节点 :
			if 节点 is 梅物品格子:
				节点.可修改物品=not 启用自动制作节点.button_pressed
				if 节点.空置标签=="调味品":
					if 启用自动制作节点.button_pressed:
						if not 节点.道具名称==null and not 计划.手工.数据调料点数(节点.道具名称)>=扣除数量:
							材料判断=false
							if 检查通知:计划.语法糖通知("错误调料点数不足","烹饪通知")
					else :
						if not 节点.道具名称==null and  not 节点.物品数量判断(1):
							材料判断=false
							if 检查通知:计划.语法糖通知("错误调料不足","烹饪通知")
				elif not 节点.物品数量判断(扣除数量):
					材料判断=false
					if 检查通知:计划.语法糖通知("%s不足"%节点.道具名称,"烹饪通知")
		else :材料判断=false
	if 启用自动制作节点.button_pressed:
		if 当前美味度<解锁美味度:
			制作.text="不能自动"
		else :
			if 修改过配方:
				制作.text="配方未保存"
			else :
				制作.text="制作*%d"%int(制作数量节点.value)
		保存.text="禁用中"
		菜谱判断=false
	else :
		制作.text="材料不足"if not 材料判断 else "制作"
		if not 材料判断:
			菜谱判断=false
			保存.text="材料不足"
		elif 当前美味度<解锁美味度:
			菜谱判断=false
			保存.text="不够美味"
		else :
			菜谱判断=true
			保存.text="保存"
	var 存档美味度:float=计划.手工.数据烹饪菜谱(料理名称,"美味度")
	var 固定属性格式="+%d卡路里\n美味度%.1f(%.1f)\n解锁需要%.0f"
	属性标签.text=固定属性格式%[卡路里,当前美味度,存档美味度,解锁美味度]
func 计算美味度():
	var 存档美味度:float=计划.手工.数据烹饪菜谱(料理名称,"美味度")
	var 调料倍率=0.25
	var 美味度合计=0
	var 菜谱阶级=计划.表格.蓝图数据(料理名称,"阶级")
	当前调料加成=0.02
	for 节点 in 格子节点数组:
		#print("物品",节点.道具名称)
		if 节点 and 节点 is 梅物品格子:
			if not 节点.道具名称==null:
				var 属性字典=计划.表格.获取属性(节点.道具名称)
				var 阶级=计划.表格.蓝图数据(节点.道具名称,"阶级")
				if 节点.空置标签=="调味品":
					if 属性字典 is Dictionary and "口味" in 属性字典:
						if 属性字典["口味"]==味道:
							调料倍率+=0.05
						美味度合计+=max(所需材料数,(阶级-菜谱阶级)*所需材料数*2)
						当前调料加成+=计划.表格.蓝图数据(节点.道具名称,"阶级")*0.005
				else :
					if 属性字典 is Dictionary and "美味度" in 属性字典:
						var 美味度倍率=1.0
						if not 节点.特殊标签=="":
							美味度倍率=计划.手工.烹饪工序查询(节点.特殊标签,"倍率")
						var 美味度=float(属性字典["美味度"])*节点.当前值*(0.5+阶级*0.5)
						美味度合计+=美味度*美味度倍率
						if 阶级<菜谱阶级:
							调料倍率-=(菜谱阶级-阶级)*0.001*节点.当前值
			else :
				if not 节点.空置标签=="调味品":
					当前美味度=0
					return
	if 调料倍率<0.1:
		调料倍率=0.1
	当前美味度= (存档美味度*调料倍率)+美味度合计*(1.0/所需材料数)
func 返回处理方法(节点:梅物品格子):
	print(节点.空置标签)
	var 食材属性=计划.表格.获取属性(节点.道具名称,null)
	if 食材属性 is Dictionary and 节点.空置标签=="调味品":
		修改过配方=true
		更新标签()
	elif 食材属性 is Dictionary and 食材属性.has("食材") and 食材属性["食材"]==菜谱.keys()[节点.编号]:
		修改过配方=true
		更新标签()
	else :
		计划.语法糖通知("不能放入这个%s物品"%节点.道具名称,"料理提示")
		解除物品(节点)
		更新标签()
func 解除物品(配方容器):
	配方容器.道具名称=null
	配方容器.特殊标签=""
	配方容器.更新文本()
var 快速反应场景
var QTE:Panel = preload("res://界面/手工系统/烹饪/qte.tscn").instantiate()
func 制作料理():
	if 快速反应场景:
		计划.steam.解锁成就("烹饪食物")
		快速反应结算(快速反应场景.得分)
		快速反应场景.queue_free()
	elif 启用自动制作节点.button_pressed:
		if 修改过配方:
			计划.语法糖通知("修改配方后需要保存重新计算时间","保存菜谱")
			return
		if not 计划.手工.队列管理("检查队列上限","烹饪"):
			计划.语法糖通知("烹饪队列已满","保存菜谱")
			return
		更新标签(true)
		if 材料判断 and 检查烹饪队列("你不能重复添加"):
			扣除材料(int(制作数量节点.value),false)
			计划.手工.队列烹饪(料理名称,int(制作数量节点.value))
			计划.更新玩法.emit()
			计划.更新_UI.emit()
			return
	else :
		更新标签(true)
		if 材料判断:
			快速反应场景=QTE.duplicate()
			add_child(快速反应场景)
			快速反应场景.global_position = (制作.global_position) + Vector2(
				制作.size.x*+0.5+快速反应场景.size.x*-0.5, -快速反应场景.size.y-10)
func 检查烹饪队列(重复提示)->bool:
	var 烹饪队列=计划.手工.队列烹饪()
	for 队列内容 in 烹饪队列:
		if not 队列内容.has("配方"):
			计划.语法糖通知("队列配方有错误","保存菜谱")
			return false
		if 队列内容["配方"]==料理名称:
			计划.语法糖通知(重复提示,"保存菜谱")
			return false
	return true
func 保存料理():
	if 检查烹饪队列("你不能在烹饪过程里调整菜谱"):
		更新标签()
		if 菜谱判断:
			var 字典={}
			for 节点 in 格子节点数组:
				if not 节点:
					print("错误:节点未找到",节点,"/",格子节点数组)
					return
				if 节点 is 梅物品格子:
					if not 节点.道具名称==null:
						字典[节点.空置标签]={"物品":节点.道具名称,"数量":节点.当前值,"标签":节点.特殊标签}
			print("保存的料理",字典)
			if 计划.手工.数据烹饪菜谱(料理名称,"保存菜谱",字典):
				计划.语法糖通知("更新配方成功","保存菜谱")
				更新材料标签()
				修改过配方=false
			else :计划.语法糖通知("更新配方失败,逻辑错误","保存菜谱")
		else :
			计划.语法糖通知("美味度不足","保存菜谱")
		
func 快速反应结算(得分):
	扣除材料(1,true)
	var 新美味度=当前美味度*(1+0.2*得分)
	计划.手工.数据烹饪菜谱(料理名称,"美味度",新美味度,当前调料加成)
	计划.语法糖通知("当前快速反应成绩%.0f%%(+%.0f%%美味度)"%[(得分*100),(得分*20)],"快速反应")
	计划.获得物品语法糖(料理名称,1)
	计划.更新_UI.emit()			
	var 烹饪精通=int(60*(1+得分))
	计划.手工.数据烹饪菜谱(料理名称,"精通",烹饪精通)
	计划.语法糖通知("%s精通增加%d"%[料理名称,烹饪精通],"烹饪精通")
	更新标签()
func 扣除材料(扣除数量:int=1,手动制作:bool=true):
	for 节点 in 格子节点数组:
		if 节点 and 节点 is 梅物品格子 and not 节点.道具名称==null:
			if not 手动制作 and 节点.空置标签=="调味品":
				计划.手工.数据调料点数(节点.道具名称,-扣除数量)
			else :
				删除逻辑(节点,扣除数量,手动制作)
func 删除逻辑(节点:梅物品格子,扣除数量:int=1,检查标签:bool=true):
	if 节点.特殊标签=="" or not 检查标签:
		计划.语法糖消耗物品(节点.道具名称,节点.当前值*扣除数量)
	else :
		计划.手工.烹饪预制(节点.道具名称,节点.特殊标签,-节点.当前值*扣除数量)
