extends Node
class_name 梅手工
var 是否前台 = false
var 后台计时器:Timer
func _ready():
	初始化.场景更新.connect(更新界面)
	后台计时器=初始化.创建计时器(2,func():更新制作队列进度条())
func 更新界面(场景名称 = null):
	是否前台 = 场景名称 == "合成界面"
	if 是否前台:
		print("合成位于前台")
		后台计时器.stop()#停止方法
	else:
		print("合成位于后台")
		后台计时器.start()#启动方法
func 更新制作队列进度条():
	var 制作参数=初始化.梅存档["手工"].get("制作参数", [])
	var 合成触发=false
	for 参数 in 制作参数:
		var 物品名称=参数["名称"]
		var 制作时长=参数["制作时长"]
		var 时间差=Time.get_unix_time_from_system()-参数["时间戳"]
		var 完整次数 = floor(时间差 / 制作时长)
		if 完整次数>=1:
			参数["时间戳"]+=int(完整次数*制作时长)
			完成制作(物品名称,完整次数)
			合成触发=true
	if 合成触发:
		初始化.保存存档("合成触发")
func 完成制作(物品名称,制作次数=1):
	var 图纸等级 = 初始化.梅存档["手工"].get(物品名称, 0)
	var 残缺图纸等级=初始化.梅存档["手工"].get(物品名称+"碎片", 0)
	if 残缺图纸等级>=1:# 残缺图纸逻辑
		if 制作次数*randf()<0.1+0.005*图纸等级:
			var 图纸等阶=int(梅表格.获取表格信息(梅表格.装备蓝图,物品名称,"阶级"))
			var 蓝图纸奖励=int(16*残缺图纸等级*(10+图纸等阶*5)*(randf()+0.1*图纸等阶))
			初始化.语法糖获得物品("蓝图纸",蓝图纸奖励)
			初始化.梅存档["手工"][物品名称+"碎片"]=0
			引擎.屏幕.滚动提示( "研究完成,蓝图纸奖励+" + str(蓝图纸奖励))
			var 制作队列 = 初始化.梅存档["手工"].get("制作队列", [])
			if 物品名称 in 制作队列:# 存在则移除
				制作队列.erase(物品名称)
				初始化.梅存档["手工"].set("制作队列", 制作队列)
				初始化.节点["合成界面"].注册进度条()
	引擎.屏幕.滚动提示( "制作成功:" + str(物品名称)+ ( "*" + str(制作次数) + "次" if 制作次数 > 1 else "" ))# 获得制作的物品及相关处理
	初始化.获得物品语法糖(物品名称, 制作次数, "标准物品")
	初始化.梅任务单例.完成任务合成(物品名称, 制作次数)
	if 图纸等级>=1:
		初始化.语法糖_快速熟练精通("手工熟练", "手工", 物品名称)
	else :
		初始化.语法糖_快速熟练精通("手工熟练", "手工", null)
func 获得蓝图(蓝图名称,提示=false):
	var 蓝图精通等级=初始化.梅存档["手工"].get(蓝图名称, 0)
	var 蓝图阶级=int(梅表格.获取表格信息(梅表格.装备蓝图,蓝图名称,"阶级"))
	if 蓝图精通等级==0:
		var 灵感的精通=抽卡精通(蓝图精通等级,蓝图阶级,false)
		if not "灵感等级精通" in 初始化.梅存档["手工"]:
			初始化.梅存档["手工"]["灵感等级精通"]=0
		初始化.梅存档["手工"]["灵感等级精通"]+=灵感的精通
		初始化.梅存档["手工"][蓝图名称]=1
		if 提示:
			引擎.屏幕.滚动提示( "恭喜获得新蓝图<"+蓝图名称+">灵感值增加:"+str(灵感的精通),"手工提示")
	else :
		var 灵感的精通=抽卡精通(蓝图精通等级,蓝图阶级)
		初始化.梅存档["手工"]["灵感等级精通"]+=灵感的精通
		初始化.语法糖获得物品("蓝图纸",8*(6+蓝图阶级))
		初始化.语法糖获得物品("黄图纸",蓝图阶级)
		if 提示:
			引擎.屏幕.滚动提示( "蓝图<"+蓝图名称+">已重复获得转化为灵感值:"+str(灵感的精通),"手工提示")
func 抽卡精通(等级: int,等阶: int,重复=true):
	if 重复:
		return 等级 * (1.25 ** 等阶) + 100# 每次抽卡获得的精通
	return int(等阶**1.2) * 100
