extends Panel
@export var 名称=""
@onready var 图片: TextureRect = $图片
@onready var 名称标签: Label = $名称
@onready var 精通条: ProgressBar = $精通条
@onready var 精通标签: Label = $精通条/精通
@onready var 标签: TabContainer = $标签
@onready var 简介标签: RichTextLabel = $标签/简介
@onready var 精通按钮: Button = $精通按钮
var 美味度=0
var 等级=0
var 精通=0
var 精通需求=0
var 简介:String=""
var 基础美味度
var 解锁美味度
func _ready() -> void:
	标签.current_tab=0
	更新节点()
	精通按钮.pressed.connect(精通项目)
func 精通项目():
	if 等级==-1:
		计划.语法糖通知("未解锁","精通升级")
		return
	蓝图解析()
	var 需求的精通 = 精通需求-精通
	var 当前精通=计划.梅存档["手工"].get("精通",0)
	if 当前精通>=需求的精通:
		计划.梅存档["手工"]["精通"]-=精通需求
		计划.手工.数据烹饪菜谱(名称,"精通",需求的精通)
		蓝图解析()
		更新节点()
		计划.更新_UI.emit()
		计划.保存存档("精通强化")
		计划.语法糖通知("精通等级提高","精通升级")
	else :
		计划.语法糖通知("精通不足,缺少:"+str(需求的精通-当前精通),"精通升级")
func 蓝图解析(新名称=名称):
	名称=新名称
	美味度=计划.手工.数据烹饪菜谱(名称,"美味度")
	基础美味度=计划.手工.数据烹饪菜谱(名称,"基础美味度")
	解锁美味度=计划.手工.数据烹饪菜谱(名称,"解锁美味度")
	等级=计划.手工.数据烹饪菜谱(名称,"等级")
	精通=计划.手工.数据烹饪菜谱(名称,"精通")
	精通需求=计划.结算升级("手工","烹饪",名称,true)
	简介=计划.表格.蓝图数据(名称,"简介")
func 更新节点():
	名称标签.text="%s\rLV:%d"%[名称,等级]
	图片.texture=计划.表格.道具贴图(名称)
	精通标签.text="%d/%d"%[精通,精通需求]
	if 等级>=0:
		精通条.max_value=精通需求
		精通条.value=精通
		简介标签.text="美味度:%.1f\r解锁美味度:%.0f\r料理美味度:%.1f\r简介:\r%s\r精通效果:\r增加美味度%d%%\r降低自动所需时间\r但不会减少精通"%[
			美味度,解锁美味度,基础美味度,简介,等级]
	else :
		精通条.max_value=1
		精通条.value=0
		简介标签.text="未解锁\r%s"%简介
