extends Panel
class_name 蓝图卡片
var 蓝图字典
var 蓝图名称="错误"
var 精通等级=-1
var 升星等级=0
var 蓝图等阶=0
var 优先级=0
func _ready() -> void:
	$"精通按钮".pressed.connect(func():精通项目("手工",蓝图名称))
	$"标签/升星/升星按钮".pressed.connect(func():升星项目("合成",蓝图名称))
	$"标签/简介".visible=true
func 蓝图解析():
	蓝图名称=蓝图字典.get("名称","错误")
	蓝图等阶=int(蓝图字典.get("阶级",0))
	var 精通需求=计划.结算升级("手工","合成",蓝图名称,true)
	var 精通=计划.手工.数据合成配方(蓝图名称,"精通")
	精通等级=计划.手工.数据合成配方(蓝图名称)
	升星等级=计划.手工.数据合成配方(蓝图名称,"升星")
	var 缓存残缺等级=计划.手工.数据合成配方(蓝图名称,"残缺图纸数量")
	if 精通等级>=0:
		优先级+=精通等级+1
		$"蓝图名称".text=蓝图名称+"\n"+"LV:"+str(精通等级)
		$"精通条".max_value=精通需求
		$"精通条".value=精通
		$"精通条/精通".text=str(精通)+"/"+str(精通需求)
		$"精通条".visible=true
		visible=true
		modulate=Color(1, 1, 1)
	else :
		$"蓝图名称".text=蓝图名称+"\n"+"暂未获得该蓝图"
		$"精通条".visible=false
		if 缓存残缺等级>=1:
			modulate=Color(0.8, 0.8, 0.8, 0.9)
			visible=true
		else :
			visible=false
			modulate=Color(0.4, 0.4, 0.4, 0.8)
	var 缓存贴图=load(蓝图字典.get("icon",""))
	if 缓存贴图:
		$"图片".texture=缓存贴图
	var 缓存简介=蓝图字典.get("简介","错误")
	if 缓存残缺等级>=1:
		优先级+=1
		缓存简介="拥有残缺蓝图*"+str(缓存残缺等级)+"\n"+缓存简介
	if 精通等级>=0:
		var 类型 = 蓝图字典.get("类型","错误")
		缓存简介+="\n"+"精通效果:\r"+计划.手工.精通加成文本(类型,int(精通等级),蓝图等阶)
	$"标签/简介".text=缓存简介
	var 材料列表 = []
	for 键 in 计划.手工.资源字典:
		if 蓝图字典.has(键) and 蓝图字典[键] is float and 蓝图字典[键] > 0:
			材料列表.append(键 + "*" + str(int(蓝图字典[键])))
	var 内容字符串 = "费用:" + ("\r"+"\r".join(材料列表) if 材料列表.size() > 0 else "无")
	for 贴图 in 计划.手工.资源字典:
		内容字符串 = 内容字符串.replace(贴图+"*", "[img=40x40]"+计划.手工.资源字典[贴图]["贴图"].resource_path+"[/img]:")
	$"标签/材料".text=内容字符串
	$"标签/属性".text=计划.获取装备属性(蓝图名称)
	$"标签/升星".text=获取升星效果文本(升星等级)
func 获取升星效果文本(星级: int) -> String:
	var 处理星级 = clamp(星级, 0, 3)
	var 文本模板 = "升星效果:\r%s降低10%%材料需求↓\r%s%s+10%%多重制作\r%s%s所有订单增加5%%单价%s"
	var 星1 = "☆"  # 1星符号
	var 行1 = "需要25级,%d黄图纸\r"%(计划.手工.数据合成配方(蓝图名称,"升星1"))  # 1星需要行
	var 星2 = "☆"  # 2星符号
	var 行2 = "需要50级,%d黄图纸\r"%(计划.手工.数据合成配方(蓝图名称,"升星2"))  # 2星需要行
	var 星3 = "☆"  # 3星符号
	var 行3 = "\r需要75级,%d黄图纸"%(计划.手工.数据合成配方(蓝图名称,"升星3"))  # 3星需要行
	if 处理星级 >= 1:
		星1 = "★"  # 替换为实心星
		行1 = ""    # 隐藏对应需要行
	if 处理星级 >= 2:
		星2 = "★"
		行2 = ""
	if 处理星级 >= 3:
		星3 = "★"
		行3 = ""
	return 文本模板 % [星1, 行1, 星2, 行2, 星3, 行3]
func 精通项目(系统,项目):
	if 精通等级==-1:
		计划.语法糖通知("当前蓝图未解锁",系统+"系统")
		return
	if 项目=="错误":
		print("蓝图精通检查时错误")
		return
	var 精通需求=计划.结算升级(系统,"合成",项目,true)
	var 当前精通=计划.梅存档["手工"].get("精通",0)
	精通需求-=计划.手工.数据合成配方(蓝图名称,"精通")
	if 当前精通>=精通需求:
		计划.梅存档["手工"]["精通"]-=精通需求
		计划.手工.数据合成配方(蓝图名称,"精通",精通需求)
		蓝图解析()
		计划.保存存档("精通强化")
		计划.emit_signal("更新_UI")
		if 计划.节点有效性检查("合成_蓝图库"):
			var 蓝图库=计划.节点["合成_蓝图库"]
			if 蓝图库.最高精通等级<精通等级:
				蓝图库.最高精通等级=精通等级
			蓝图库.总等级+=1
			if 精通等级==25 or 精通等级==50 or 精通等级==75 or 精通等级==100:
				蓝图库.强化点+=1
			蓝图库.更新文本()
	else :
		计划.语法糖通知("精通不足,缺少:"+str(精通需求-当前精通),系统+"系统")

func 升星项目(玩法,项目):
	match 玩法:
		"合成":
			var 结果 = 计划.手工.数据合成配方(项目,"升星","升星")
			if 结果=="成功":计划.语法糖通知("升星成功")
			else :计划.语法糖通知(结果)
		_:	pass
	蓝图解析()
