extends Node
class_name 梅技能树
var 技能研究倍数:int=1
##技能树字典定义
var 技能树字典: Dictionary = {
	"挂机核心": {
			"简介": "挂机精通池上限扩容",
			"最大等级": 100,
			"研究费用": 2000,
			"基础强度": 0,
			"每级增加强度": 100,
			"前置技能": [],
			"系统": "挂机",
			"图标代码": "挂机精通代币"},
		"订单提交改良": {
			"简介": "一次性提交多个订单",
			"最大等级": 9,
			"研究费用": 5000,
			"基础强度": 1,
			"每级增加强度": 1,
			"前置技能": ["挂机核心"],
			"系统": "挂机",
			"图标代码": "订单提升"},
		"额外的订单": {
			"简介": "自动刷新的订单概率额外增加刷新次数",
			"最大等级": 10,
			"研究费用": 8000,
			"基础强度": 1,
			"每级增加强度": 0.1,
			"前置技能": ["挂机核心"],
			"系统": "挂机",
			"图标代码": "订单翻倍"},
		"订单标签": {
			"简介": "增加订单刷新增益标签的权重",
			"最大等级": 10,
			"研究费用": 5000,
			"基础强度": 1.0,
			"每级增加强度": 0.1,
			"前置技能": ["订单提交改良"],
			"系统": "挂机",
			"图标代码": "订单提升",
			"更新参数":"修饰词"},
		"订单标签价格": {
			"简介": "额外增强价格效果的标签对倍率的最大影响",
			"最大等级": 10,
			"研究费用": 5000,
			"基础强度": 0.0,
			"每级增加强度": 0.05,
			"前置技能": ["订单提交改良"],
			"系统": "挂机",
			"图标代码": "订单提升"},
		"仓储材料": {
			"简介": "允许带有<材料>标签的物品增加额外堆叠上限,多个技能效果取最大值",
			"最大等级": 10,
			"研究费用": 1500,
			"基础强度": 0,
			"每级增加强度": 50,
			"前置技能": ["额外的订单"],
			"系统": "挂机",
			"图标代码": "背包",
			"更新参数":"堆叠"},
		"仓储炼金": {
			"简介": "允许带有<炼金>标签的物品增加额外堆叠上限,多个技能效果取最大值",
			"最大等级": 10,
			"研究费用": 1500,
			"基础强度": 0,
			"每级增加强度": 50,
			"前置技能": ["仓储材料"],
			"系统": "挂机",
			"图标代码": "背包",
			"更新参数":"堆叠"},
		"仓储食材": {
			"简介": "允许带有<食材>标签的物品增加额外堆叠上限,多个技能效果取最大值",
			"最大等级": 10,
			"研究费用": 1500,
			"基础强度": 0,
			"每级增加强度": 50,
			"前置技能": ["仓储材料"],
			"系统": "挂机",
			"图标代码": "背包",
			"更新参数":"堆叠"},
	"木料核心": {
		"简介": "木料精通池上限扩容",
		"最大等级": 100,
		"研究费用": 2000,
		"基础强度": 0,
		"每级增加强度": 100,
		"前置技能": [],
		"系统": "木料",
		"图标代码": "木料精通代币"},
	"矿城核心": {
		"简介": "矿城精通池上限扩容",
		"最大等级": 100,
		"研究费用": 2000,
		"基础强度": 0,
		"每级增加强度": 100,
		"前置技能": [],
		"系统": "矿城",
		"图标代码": "矿城精通代币"},
	"手工核心": {
			"简介": "手工精通池上限扩容",
			"最大等级": 100,
			"研究费用": 2000,
			"基础强度": 0,
			"每级增加强度": 100,
			"前置技能": [],
			"系统": "手工",
			"图标代码": "手工精通代币"},
		"研究残缺图纸": {
			"简介": "增加获取残缺图纸的最大上限",
			"最大等级": 4,
			"研究费用": 5000,
			"基础强度": 6,
			"每级增加强度": 1,
			"前置技能": ["手工核心"],
			"系统": "手工",
			"图标代码": "残缺图纸"},
		"研究改良": {
			"简介": "解锁连续抽奖",
			"最大等级": 9,
			"研究费用": 8000,
			"基础强度": 3,
			"每级增加强度": 1,
			"前置技能": ["手工核心"],
			"系统": "手工",
			"图标代码": "抽奖机"},
		"残缺灵感": {
			"简介": "当获取到的是残缺蓝图时获得部分灵感",
			"最大等级": 5,
			"研究费用": 2000,
			"基础强度": 5,
			"每级增加强度": 3,
			"前置技能": ["研究残缺图纸"],
			"系统": "手工",
			"图标代码": "残缺图纸"},
		"工序优化": {
			"简介": "前3个处理工序技能树等级上限",
			"最大等级": 20,
			"研究费用": 5000,
			"基础强度": 10,
			"每级增加强度": 2,
			"前置技能": ["研究改良"],
			"系统": "手工",
			"图标代码": "烹饪代币"},
		"工序清洗": {
			"简介": "额外增加清洗工序增加的美味度",
			"最大等级": 0,
			"研究费用": 1000,
			"基础强度": 0.0,
			"每级增加强度": 0.01,
			"前置技能": ["工序优化"],
			"系统": "手工",
			"图标代码": "烹饪代币"},
		"工序切割": {
			"简介": "额外增加切割工序增加的美味度",
			"最大等级": 0,
			"研究费用": 1100,
			"基础强度": 0.0,
			"每级增加强度": 0.01,
			"前置技能": ["工序优化"],
			"系统": "手工",
			"图标代码": "烹饪代币"},
		"工序腌制": {
			"简介": "额外增加腌制工序增加的美味度",
			"最大等级": 0,
			"研究费用": 1200,
			"基础强度": 0.0,
			"每级增加强度": 0.01,
			"前置技能": ["工序优化"],
			"系统": "手工",
			"图标代码": "烹饪代币"},
	"游历核心": {
		"简介": "游历精通池上限扩容",
		"最大等级": 100,
		"研究费用": 2000,
		"基础强度": 0,
		"每级增加强度": 100,
		"前置技能": [],
		"系统": "游历",
		"图标代码": "游历精通代币"},
	"职业核心": {
		"简介": "职业精通池上限扩容",
		"最大等级": 100,
		"研究费用": 2000,
		"基础强度": 0,
		"每级增加强度": 100,
		"前置技能": [],
		"系统": "职业",
		"图标代码": "职业精通代币"},
	"召唤核心": {
		"简介": "召唤精通池上限扩容",
		"最大等级": 100,
		"研究费用": 2000,
		"基础强度": 0,
		"每级增加强度": 100,
		"前置技能": [],
		"系统": "召唤",
		"图标代码": "召唤精通代币"},
}
##缓存订单标签权重
var 生成修饰词权重数组:PackedFloat32Array=[]
#region 技能树
##默认返回值强度
func 数据技能树(技能="技能名称",返回="强度",增值=0):
	if not 技能树字典.has(技能):
		print("报错正在查询一个不存在的技能",技能)
		return ""
	if not 技能树字典[技能].has("系统"):
		print("报错%s技能缺少必备\"技能\"参数"%技能)
		return ""
	match 返回:
		"字典":return 技能树字典[技能]
		"简介":return 技能树字典[技能].get(返回,"")
		"最大等级":
			if ["工序清洗","工序切割","工序腌制",].has(技能):
				return 数据技能树("工序优化","强度")
			return 技能树字典[技能].get(返回,0)
		"基础强度":return 技能树字典[技能].get(返回,0)
		"每级增加强度":return 技能树字典[技能].get(返回,0)
		"前置技能":return 技能树字典[技能].get(返回,[])
		"图标代码":return 计划.表格.道具贴图(技能树字典[技能].get(返回,"未知贴图"))
		"更新参数":return 技能树字典[技能].get(返回,"无")
	var 系统=技能树字典[技能].get("系统","挂机")
	if 计划.梅存档.has(系统) and 计划.梅存档[系统].has("技能树"):
		var 技能树:Dictionary=计划.梅存档[系统]["技能树"]
		if not 技能树.has(技能):技能树[技能]={}
		var 技能等级=int(技能树[技能].get("等级",0))
		match 返回:
			"等级":return 技能等级
			"研究进度":
				if 增值 is int or 增值 is float :
					技能树[技能]["研究进度"]=技能树[技能].get(返回,0.0)+float(增值)
					var 研究费用=数据技能树(技能,"研究费用")
					if 技能树[技能]["研究进度"]>=研究费用:
						技能树[技能]["研究进度"]-=研究费用
						技能树[技能]["等级"]=int(技能等级+1)
				return float(技能树[技能].get(返回,0.0))
			"强度":
				#print("基础强度",技能树字典[技能]["基础强度"])
				#print("增加强度",(技能等级*技能树字典[技能]["每级增加强度"]))
				return 技能树字典[技能]["基础强度"]+(技能等级*技能树字典[技能]["每级增加强度"])
			"研究费用":
				var 基础价格=技能树字典[技能].get(返回,2000)
				var 最大等级 = 技能树字典[技能].get(返回,0)
				if 技能等级==0:return 基础价格
				elif 最大等级<=0 or 技能等级>=最大等级:return -1#不能升级
				else:
					var 增长率=pow(最大等级, 1.0 / 最大等级)#数量级起作用
					var 额外倍率=2*pow(技能等级/10.0, 1.25)#较低等级时起作用
					return int(基础价格*(增长率**技能等级+额外倍率))
			_:return ""
	match 返回:
		"等级":return 0
		"研究进度":return 0.0
		_:return 0
##加入队列传入技能名称
func 队列技能(技能名称:="",执行次数:int=1)->Array:
	var 技能: Dictionary=技能队列参数("技能")
	if not 技能名称=="":
		技能数组合法性检查(技能,"制作队列")
		if 执行次数>0:
			if 技能["制作队列"].size()<技能["制作队列上限"]:
				技能["制作队列"]+=[{
					"制作次数":执行次数,
					"技能名称":技能名称,
					"时间戳":int(Time.get_unix_time_from_system())}]
			else :
				for 制作 in 技能["制作队列"]:
					if 制作["技能名称"]==技能名称:
						制作["制作次数"]+=执行次数
						return 技能["制作队列"]
				计划.语法糖通知("失败,研究队列已满","研究队列")
		elif 执行次数<0:
			#技能["制作队列"]=[]
			for 制作 in 技能["制作队列"]:
				if 制作["技能名称"]==技能名称:
					if 制作["制作次数"]<=abs(执行次数):
						制作["制作次数"]=0
						技能数组合法性检查(技能,"制作队列")
						return 技能["制作队列"]
					else :
						制作["制作次数"]+=执行次数#负数时逻辑
						break
	return 技能["制作队列"]
func 技能队列参数(读取值,覆盖值=""):
	var 挂机系统=计划.梅存档["挂机"]
	if not "技能" in 挂机系统["队列"]:
		挂机系统["队列"]["技能"]={
				"制作队列": [],
				"研究强度":1,
				"制作队列上限":1}
	var 技能: Dictionary=挂机系统["队列"]["技能"]
	技能["制作队列上限"]=1+max(0,int(0.1*挂机系统["等级"]))
	match 读取值:
		"制作队列":return 技能[读取值]
		"制作队列上限":return 技能[读取值]
		"研究强度":
			if 覆盖值 is int:
				技能[读取值]=覆盖值
			return 技能[读取值]
		"技能":return 技能
func 技能数组合法性检查(字典,数组名):
	if not 字典[数组名] is Array:
		print("不能处理非数组")
		return false
	var 合法制作队列:Array = []
	for 队列元素 in 字典[数组名]:
		if 队列元素 is Dictionary and 队列元素.has("制作次数") and 队列元素["制作次数"]>0:
			合法制作队列.append(队列元素)
	if not 合法制作队列.size()==字典[数组名].size():
		字典[数组名] = 合法制作队列
##返回是否与更新,每次检查最多判断一级升级
func 检查技能树队列()->bool:
	var 技能: Dictionary=技能队列参数("技能")
	if 技能["制作队列"].size()<=0:
		return false
	技能数组合法性检查(技能,"制作队列")
	var 当前时间:int=int(Time.get_unix_time_from_system())
	var 修改:bool=false
	var 研究强度:int=技能["研究强度"]
	var 研究费用:int=研究强度**2
	var 技能字典=技能["制作队列"][0]
	if 当前时间>=技能字典["时间戳"] and 技能字典["制作次数"]>=1:
		var 最大等级:int=int(数据技能树(技能字典["技能名称"],"最大等级"))
		var 当前等级:int=数据技能树(技能字典["技能名称"],"等级")
		if 当前等级>=最大等级:#超过最大等级
			技能字典["制作次数"]=0
			修改=true
		else :
			var 需求进度:float=float(数据技能树(技能字典["技能名称"],"研究费用"))
			var 当前进度:float=数据技能树(技能字典["技能名称"],"研究进度")
			var 研究推进:int=clamp(int(当前时间-技能字典["时间戳"]),0,ceili((需求进度-当前进度)/研究强度))
			技能字典["时间戳"]+=研究推进
			var 金币限制=false
			if 研究费用*研究推进>计划.梅存档["金币"]:
				研究推进=int(1.0*计划.梅存档["金币"]/研究费用)
				金币限制=true
				if 研究推进==0:
					计划.语法糖通知("金币不足")
					技能["制作队列"]=[]
					return true
			if 计划.语法糖金币消费(研究费用*研究推进):
				修改=true
				var 新进度:float=数据技能树(技能字典["技能名称"],"研究进度",研究推进*研究强度*技能研究倍数)
				if 新进度<=当前进度:
					技能字典["制作次数"]+=-1
					更新技能缓存(数据技能树(技能字典["技能名称"],"更新参数"))
					#print("新进度",新进度,"/",当前进度,"\r研究推进点数",研究费用*研究推进)
				if 金币限制:#跳过其他检查,并移除队列
					技能["制作队列"]=[]
					return true
	if 修改:技能数组合法性检查(技能,"制作队列")
	return 修改
func 更新技能缓存(更新类型="所有"):
	if 更新类型=="所有" or 更新类型=="修饰词":
		生成修饰词权重数组=[]
	if 更新类型=="所有" or 更新类型=="堆叠":
		计划.表格.清空额外堆叠上限缓存()
		if ContainerRepository.instance:
			ContainerRepository.instance.更新所有物品堆叠()
	print("技能缓存更新参数:%s"%更新类型)
#endregion 技能树
