extends Resource
class_name 梅窗口
var 窗口数据: Dictionary = {
	# 基础隐藏类窗口
	"默认窗口": {
		"场景路径": "res://界面/空界面.tscn",
		"贴图": "",
		"显示名": "默认",
		"子界面": [],
		"简介": [],
		"图钉": []
	},
	"开始菜单": {
		"场景路径": "res://界面/开始菜单/开始菜单.tscn",
		"贴图": "",
		"显示名": "开始",
		"子界面": [],
		"简介": [],
		"图钉": []
	},
	"测试功能": {
		"场景路径": "res://界面/根界面/测试功能.tscn",
		"贴图": "",
		"显示名": "测试",
		"子界面": [],
		"简介": [],
		"图钉": []
	},

	# 挂机系统相关
	"任务窗口": {
		"场景路径": "res://界面/挂机系统/任务窗口/任务界面.tscn",
		"贴图": "res://素材/豆包AI素材/图标/任务图标.png",
		"显示名": "任务",
		"子界面": ["设置界面","背包界面","原罪_傲慢界面"],
		"简介": ["一切任务的起点,同时可以管理设置选项", "无法隐藏的窗口"],
		"图钉": ["绿色电路板"]
	},
	"设置界面": {
		"场景路径": "res://界面/挂机系统/设置/设置界面.tscn",
		"贴图": "res://素材/豆包AI素材/图标/设置图标.png",
		"显示名": "设置",
		"子界面": [],
		"简介": [],
		"图钉": [],
		"解锁":true
	},
	"故事界面": {
		"场景路径": "res://界面/挂机系统/故事/故事界面.tscn",
		"贴图": "res://素材/豆包AI素材/图标/故事图标.png",
		"显示名": "故事",
		"子界面": [],
		"简介": [],
		"图钉": []
	},
	"原罪界面": {
		"场景路径": "res://界面/挂机系统/原罪/原罪界面.tscn",
		"贴图": "res://素材/豆包AI素材/图标/原罪图标.png",
		"显示名": "原罪",
		"子界面": [],
		"简介": ["来自神话的力量"],
		"图钉": ["金币"]
	},
	"原罪_暴食界面": {
		"场景路径": "res://界面/挂机系统/原罪/暴食界面.tscn",
		"贴图": "res://素材/豆包AI素材/图标/原罪图标.png",
		"显示名": "暴食",
		"子界面": [],
		"简介": [],
		"图钉": []
	},
	"原罪_傲慢界面": {
		"场景路径": "res://界面/挂机系统/原罪/傲慢界面.tscn",
		"贴图": "res://素材/豆包AI素材/图标/原罪图标.png",
		"显示名": "傲慢",
		"子界面": [],
		"简介": [],
		"图钉": [],
		"解锁":true
	},
	"原罪_贪婪界面": {
		"场景路径": "res://界面/挂机系统/原罪/贪婪界面.tscn",
		"贴图": "res://素材/豆包AI素材/图标/原罪图标.png",
		"显示名": "贪婪",
		"子界面": [],
		"简介": [],
		"图钉": []
	},

	# 手工系统相关
	"合成界面": {
		"场景路径": "res://界面/手工系统/合成/合成界面.tscn",
		"贴图": "res://素材/豆包AI素材/图标/合成图标.png",
		"显示名": "合成",
		"子界面": ["合成_蓝图库界面"],
		"简介": ["准备好去研究蓝图了吗", "在此之前先合成一些材料吧"],
		"图钉": ["资源回复代币"]
	},
	"合成_抽奖机界面": {
		"场景路径": "res://界面/手工系统/合成/合成_抽奖机界面.tscn",
		"贴图": "res://素材/豆包AI素材/图标/合成图标.png",
		"显示名": "抽奖",
		"子界面": [],
		"简介": ["是的可以研究新的蓝图了"],
		"图钉": ["金币", "蓝图纸"]
	},
	"合成_蓝图库界面": {
		"场景路径": "res://界面/合成_蓝图库界面.tscn",
		"贴图": "res://素材/豆包AI素材/图标/合成图标.png",
		"显示名": "精通",
		"子界面": [],
		"简介": [],
		"图钉": ["金币", "黄图纸"],
		"解锁":true
	},
	"合成_强化界面": {
		"场景路径": "res://界面/手工系统/合成/合成_强化界面.tscn",
		"贴图": "res://素材/豆包AI素材/图标/合成图标.png",
		"显示名": "强化",
		"子界面": [],
		"简介": [],
		"图钉": []
	},
	"烹饪界面": {
		"场景路径": "res://界面/手工系统/烹饪/烹饪界面.tscn",
		"贴图": "res://素材/豆包AI素材/图标/烹饪图标.png",
		"显示名": "烹饪",
		"子界面": [],
		"简介": [],
		"图钉": ["烹饪代币"]
	},
	"炼金界面": {
		"场景路径": "res://界面/手工系统/炼金/炼金界面.tscn",
		"贴图": "res://素材/豆包AI素材/图标/炼金.png",
		"显示名": "炼金",
		"子界面": [],
		"简介": ["手工系统第二章"],
		"图钉": ["催化剂代币"]
	},

	# 核心功能界面
	"背包界面": {
		"场景路径": "res://界面/背包界面.tscn",
		"贴图": "res://素材/豆包AI素材/图标/背包图标.png",
		"显示名": "背包",
		"子界面": [],
		"简介": ["在这检查你冒险的收获", "在这整理你的装备", "在这消费购买道具"],
		"图钉": [],
		"解锁":true
	},
	"战斗界面": {
		"场景路径": "res://界面/战斗界面.tscn",
		"贴图": "res://素材/豆包AI素材/图标/战斗图标.png",
		"显示名": "战斗",
		"子界面": ["战斗_副本"],
		"简介": ["战斗!"],
		"图钉": []
	},
	"战斗_副本": {
		"场景路径": "res://界面/战斗副本.tscn",
		"贴图": "res://素材/豆包AI素材/图标/战斗图标.png",
		"显示名": "副本",
		"子界面": [],
		"简介": ["你玩过方块地牢吗?"],
		"图钉": [],
		"解锁":true
	},
	"订单界面": {
		"场景路径": "res://界面/挂机系统/订单/订单界面.tscn",
		"贴图": "res://素材/豆包AI素材/图标/订单图标.png",
		"显示名": "订单",
		"子界面": [],
		"简介": [],
		"图钉": ["蓝图纸", "黄图纸", "金币"]
	},
	# 小游戏相关
	"小游戏界面": {
		"场景路径": "res://界面/小游戏界面.tscn",
		"贴图": "res://素材/豆包AI素材/图标/小游戏图标.png",
		"显示名": "游戏",
		"子界面": ["小游戏_水排序"],
		"简介": ["让时间加速的方法"],
		"图钉": []
	},
	"小游戏_水排序": {
		"场景路径": "res://界面/水排序.tscn",
		"贴图": "res://素材/豆包AI素材/图标/小游戏图标.png",
		"显示名": "水序",
		"子界面": [],
		"简介": ["动动手指倒液体", "把混乱的彩色水送回家"],
		"图钉": [],
		"解锁":true
	}
	}
func 获取默认解锁窗口()->Array:
	var 窗口数组:Array=[]
	for 窗口名 in 窗口数据:
		if 窗口数据[窗口名].has("解锁"):窗口数组.append(窗口名)
	return 窗口数组
func 解锁窗口(窗口名称:String):
	if 计划:
		var 窗口解锁数组: Array = 计划.梅存档.挂机.窗口解锁
		var 窗口禁用数组: Array = 计划.梅存档.挂机.窗口禁用
		if not 窗口解锁数组.has(窗口名称):
			窗口解锁数组.append(窗口名称)
		for 界面名称 in 窗口数据[窗口名称].子界面:
			if not 窗口解锁数组.has(界面名称):
				窗口解锁数组.append(界面名称)
				窗口禁用数组.append(界面名称)
