extends Node
class_name 梅窗口
var 界面路径映射: Dictionary = {# 路径映射字典，维护界面名称与对应路径的关系
	"任务窗口":["res://界面/任务窗口.tscn","挂机"],
	"合成界面": ["res://界面/合成界面.tscn","手工"],
	"合成_抽奖机界面": ["res://界面/合成_抽奖机界面.tscn","手工"],
	"背包界面": ["res://界面/背包界面.tscn","挂机"],
	"小游戏界面": ["res://界面/小游戏界面.tscn","挂机"],
	"小游戏_水排序":["res://界面/水排序.tscn","挂机"],
	"战斗界面":["res://界面/战斗界面.tscn","游历"],
	"战斗_副本":["res://界面/战斗副本.tscn","游历"],
}#数组参数1.场景路径
#参数2.场景对应的系统
var 界面父子关系: Dictionary = {# 界面父子关系字典，键为主界面名称，值为子界面名称数组
	"任务窗口":[],
	"合成界面": ["合成_抽奖机界面"],
	"背包界面": [],
	"战斗界面": ["战斗_副本"],
	"小游戏界面": ["小游戏_水排序"],
}
var 界面简介: Dictionary = {#键为主界面名称，值为界面简介元素之间为换行
	"任务窗口":["一切任务的起点,同时可以管理设置选项","无法隐藏的窗口"],
	"合成界面": ["准备好去研究蓝图了吗","在此之前先合成一些材料吧"],
	"合成_抽奖机界面": ["是的可以研究新的蓝图了"],
	"背包界面": ["在这检查你冒险的收获","在这整理你的装备","在这消费购买道具"],
	"小游戏界面": ["让时间加速的方法"],
	"小游戏_水排序":["动动手指倒液体","把混乱的彩色水送回家"],
	"战斗界面":["战斗!"],
	"战斗_副本":["你玩过方块地牢吗?"],
}
var 界面图钉: Dictionary = {#键为主界面名称，值为界面简介元素之间为换行
	"任务窗口":["绿色电路板"],
	"合成界面": [],
	"合成_抽奖机界面": ["金币"],
	"背包界面": [],
	"小游戏界面": [],
	"小游戏_水排序":[],
	"战斗界面":[],
	"战斗_副本":[],
}
