extends Node
class_name 梅窗口
var 界面路径映射: Dictionary = {# 路径映射字典，维护界面名称与对应路径的关系
	"默认窗口":["res://界面/空界面.tscn",""],#隐藏逻辑
	"开始菜单":["res://界面/开始菜单/开始菜单.tscn",""],#隐藏逻辑
	"测试功能":["res://界面/根界面/测试功能.tscn",""],#隐藏逻辑
	"任务窗口":["res://界面/挂机系统/任务窗口/任务窗口.tscn","res://素材/豆包AI素材/图标/任务图标.png"],
	"合成界面": ["res://界面/合成界面.tscn","res://素材/豆包AI素材/图标/合成图标.png"],
	"合成_抽奖机界面": ["res://界面/合成_抽奖机界面.tscn","res://素材/豆包AI素材/图标/合成图标.png"],
	"合成_蓝图库界面": ["res://界面/合成_蓝图库界面.tscn","res://素材/豆包AI素材/图标/合成图标.png"],
	"背包界面": ["res://界面/背包界面.tscn","res://素材/豆包AI素材/图标/背包图标.png"],
	"小游戏界面": ["res://界面/小游戏界面.tscn","res://素材/豆包AI素材/图标/小游戏图标.png"],
	"小游戏_水排序":["res://界面/水排序.tscn","res://素材/豆包AI素材/图标/小游戏图标.png"],
	"战斗界面":["res://界面/战斗界面.tscn","res://素材/豆包AI素材/图标/战斗图标.png"],
	"战斗_副本":["res://界面/战斗副本.tscn","res://素材/豆包AI素材/图标/战斗图标.png"],
	"订单界面":["res://界面/订单界面.tscn","res://素材/豆包AI素材/图标/订单图标.png"],
	"炼金界面":["res://界面/炼金界面.tscn","res://素材/豆包AI素材/图标/炼金.png"],
	"原罪界面":["res://界面/挂机系统/原罪/原罪界面.tscn","res://素材/豆包AI素材/图标/原罪图标.png"],
	"烹饪界面":["res://界面/手工系统/烹饪/烹饪界面.tscn","res://素材/豆包AI素材/图标/烹饪图标.png"],
}#数组参数1.场景路径
#参数2.场景对应的图标(如果有,可以为"")
var 界面父子关系: Dictionary = {# 界面父子关系字典，键为主界面名称，值为子界面名称数组
	"任务窗口":[],
	"合成界面": ["合成_抽奖机界面","合成_蓝图库界面"],
	"背包界面": [],
	"战斗界面": ["战斗_副本"],
	"小游戏界面": ["小游戏_水排序"],
	"订单界面":[],
	"炼金界面":[],
	"默认窗口":[],
	"原罪界面":[],
	"烹饪界面":[],
}
var 界面简介: Dictionary = {#键为主界面名称，值为界面简介元素之间为换行
	"任务窗口":["一切任务的起点,同时可以管理设置选项","无法隐藏的窗口"],
	"合成界面": ["准备好去研究蓝图了吗","在此之前先合成一些材料吧"],
	"炼金界面":["手工系统第二章"],
	"合成_抽奖机界面": ["是的可以研究新的蓝图了"],
	"背包界面": ["在这检查你冒险的收获","在这整理你的装备","在这消费购买道具"],
	"小游戏界面": ["让时间加速的方法"],
	"小游戏_水排序":["动动手指倒液体","把混乱的彩色水送回家"],
	"战斗界面":["战斗!"],
	"战斗_副本":["你玩过方块地牢吗?"],
	"原罪界面":["来自神话的力量"],
}
var 界面图钉: Dictionary = {#键为主界面名称，值为界面简介元素之间为换行
	"任务窗口":["绿色电路板"],
	"合成界面": [],
	"合成_抽奖机界面": ["金币","蓝图纸"],
	"合成_蓝图库界面": ["金币","黄图纸"],
	"背包界面": [],
	"小游戏界面": [],
	"小游戏_水排序":[],
	"战斗界面":[],
	"战斗_副本":[],
	"订单界面":["蓝图纸","黄图纸","金币"],
	"原罪界面":[],
}
