extends Resource
class_name 梅订单数据
##可能触发一些任务条件
var 修饰词字典:Dictionary={"任务":["普通","稀有","罕见","绝版","限定"],#存在任务功能
	"单价":["优质","完美","卓越","精良","顶级","上乘","优选","精品","优品","臻品","绝佳","超凡","高端","精粹","锦鲤"],#增加单价
	"需求":["极速","快捷","高效","速达","迅捷","神速","快单","急单","捷取","锦鲤"],#增加需求物品数量
	"幸运":["珍品","福运","祥瑞","吉运","好运","顺遂","幸运","福泽","吉兆","锦鲤"]}#增加额外奖励
var 特殊修饰词权重:Dictionary = {"普通":100,"稀有":10,"罕见":3,"绝版":0,"限定":0,"锦鲤":0.5}
var 修饰词数组:Array=[]:
	get:
		if 修饰词数组.size()==0:
			for 词语分组 in 修饰词字典:
				for 词语 in 修饰词字典[词语分组]:
					if not 修饰词数组.has(词语):修饰词数组.append(词语)
		return 修饰词数组
var 生成修饰词权重数组:PackedFloat32Array:
	get:
		if 生成修饰词权重数组.size()==0:
			if 计划.技能树.生成修饰词权重数组.size()==0:
				var 权重列表: Array[float] = []
				for 修饰词 in 修饰词数组:# 字典中有配置则用配置值，否则默认1.0
					if 计划.就绪():
						var 权重 = 特殊修饰词权重.get(修饰词, 1.0+计划.技能树.数据技能树("订单标签","强度"))
						权重列表.append(权重)
					else :权重列表.append(1)
				生成修饰词权重数组=PackedFloat32Array(权重列表)
				if 计划.就绪():计划.技能树.生成修饰词权重数组=生成修饰词权重数组
			else :
				生成修饰词权重数组=计划.技能树.生成修饰词权重数组
		return 生成修饰词权重数组
##订单名称对应的物品类型,如果为""表示,订单无效
@export var 名称: String=""
##一定程度影响其他数值
@export var 修饰: String
##每个订单量需要提交多少个物品,存在随机性
@export var 订单量: int = 0
##单价% 初始为75%,每次提交衰减当前1%,向上取整
@export var 单价: float = 0.75
##单价% 初始为75%,每次提交衰减当前1%,向上取整
@export var 单价损失: float = 0.975:
	get:return min(0.99,单价损失)
## 订单标记
@export var 订单类型: String = "材料"
##每次获得额外奖励时减1,为0时仅获取金币.
@export var 额外奖励: int = 10
##时间戳
@export var 时限: float = -1
@export var 物品数组:Array[String]=[]
var 背包数量: int:
	get:return 计划.检查背包物品数量(名称)
var 价格: int:
	get:return 多次提交价格(1)
func 多次提交价格(提交数量:int,更新单价=false)->int:
	if 提交数量 <= 0:return 0
	var 金币:int=0
	var 物品价值:int=计划.表格.蓝图数据(名称,"价值")*订单量
	var 基础单价:float=单价
	var 已计算提交量:int=0
	for i in range(提交数量):
		金币+=int(物品价值*基础单价)
		基础单价*=单价损失
		已计算提交量+=1
		if 基础单价<=0.5:
			基础单价=0.5
			if 已计算提交量<提交数量:
				金币+=int(物品价值*基础单价*(提交数量-已计算提交量))
			break
	if 更新单价:单价=基础单价
	return 金币
var 图标:String="res://素材/豆包AI素材/图标/订单图标.png"
##同步存档和订单卡片,订单卡片更新时发现订单删除会跟随删除
var 删除标记:bool=false
##打包数据引用
var 打包数据:任务打包资源
func 提交订单(提交订单量:int=1)->bool:
	var 订单数量:int=int(计划.数据体力("体力")/5.0)
	if 订单数量<=0 and 额外奖励<=0:
		计划.语法糖通知("没有提交次数或体力","订单")
		return false
	elif 订单数量+额外奖励<提交订单量:
		计划.语法糖通知("提交数量大于订单量","订单")
		return false
	if 背包数量>=订单量*提交订单量:
		if 提交订单量>额外奖励:
			计划.体力门票(5*(提交订单量-额外奖励))
		if 修饰=="稀有":
			计划.steam.解锁成就("稀有的交易")
		计划.语法糖消耗物品(名称,订单量*提交订单量)
		计划.梅存档["金币"]+=int(多次提交价格(提交订单量,true))
		if 额外奖励>=1:额外奖励=max(0,额外奖励-提交订单量)
		计划.任务.任务通用(计划.任务.进度类型.订单,订单量*提交订单量,名称)
		return true
	return false
func 放弃():
	var 新时限:float=Time.get_unix_time_from_system()+120
	if 新时限<时限 or 时限==-1:
		时限=新时限
	名称=""
	物品数组=[]
##随机生成订单
func 生成订单数据() -> bool:
	var 道具池:Array=获取指定类型图纸()
	时限=Time.get_unix_time_from_system()+3000+randi() % 600
	物品数组=[]
	订单量 = 10 + (randi() % 11)
	if 道具池.size()>=1:
		道具池.shuffle()
		名称=道具池[0]
		var 抽取次数:int=max(2,randi()%6)
		for 物品名 in 道具池:
			if 抽取次数>=1:
				抽取次数-=1
				物品数组.append(物品名)
	else :
		名称=""#找不到物品
		return false
	#print(名称,物品数组)
	额外奖励=2
	单价=0.75
	var 类型=计划.表格.蓝图数据(名称,"类型")
	if 计划.手工.配方精通效果["价格"].has(类型):
		var 精通等级=计划.手工.数据合成配方(名称)
		if 精通等级>=1:
			单价=min(20,1.0305 ** 精通等级)*单价
	var 三星数量:int=计划.手工.数据合成配方("","升星3数量")
	if 三星数量>=1:单价+=0.01*三星数量
	修饰修改器("随机")
	if 修饰词字典["单价"].has(修饰):
		单价+=0.2+(0.3+计划.技能树.数据技能树("订单标签价格","强度"))*randf()
	if 修饰词字典["需求"].has(修饰):
		订单量=int((1.2+0.3*randf())*订单量)
	if 修饰词字典["幸运"].has(修饰):
		额外奖励+=2
	return true
func 修饰修改器(值):
	if 修饰词字典["任务"].has(值):修饰=值
	elif 修饰词字典.has(值)and 修饰词字典[值] is Array and 修饰词字典[值].size()>=1:
		修饰=修饰词字典[值][randi_range(0,修饰词字典[值].size()-1)]
	else :#随机数抽取逻辑
		var 随机=RandomNumberGenerator.new()
		随机.seed=randi()
		var 序号=随机.rand_weighted(生成修饰词权重数组)
		修饰=修饰词数组[序号]
	#print(修饰词数组)
func 获取指定类型图纸()->Array:
	var 可选标签数组:=打包数据.订单解锁标签.duplicate()
	可选标签数组.shuffle()
	订单类型=可选标签数组[0]
	var 图纸数组=打包数据.根据标签获取已获得物品(订单类型)
	return 图纸数组
